playrinc/FreeOS/main/ESP32Support.c
//
//  ESP32Support.c
//  
//
//  Created by Chris Galzerano on 2/7/26.
//

#include "ESP32Support.h"

#define MINIMP3_IMPLEMENTATION
#include "minimp3.h"

#include "FilesApp.h"
#include "ClockApp.h"
#include "PaintApp.h"
#include "MusicApp.h"

wl_handle_t wl_handle = WL_INVALID_HANDLE;

// Pin Definitions SPI LCD

#define PIN_NUM_MOSI        11
#define PIN_NUM_CLK         12
#define PIN_NUM_CS          10
#define PIN_NUM_DC           9
#define PIN_NUM_RST          8
#define PIN_NUM_BK_LIGHT     -1 // Use a real GPIO if you have a backlight control pin

// --- NEW, CORRECTED PIN CONFIGURATION ---
#define I2C_HOST           I2C_NUM_0
#define PIN_NUM_TOUCH_RST  4   // Your RST pin
#define PIN_NUM_TOUCH_INT  5   // Your INT pin
#define PIN_NUM_I2C_SDA    6   // Your SDA pin
#define PIN_NUM_I2C_SCL    7   // Your SCL pin




// --- Configuration for ILI9488 ---
#if defined(USE_ILI9488)
#define LCD_PIXEL_CLOCK_HZ (30 * 1000 * 1000)
#define LCD_H_RES          320
#define LCD_V_RES          480
#define LCD_COLOR_SPACE    ESP_LCD_COLOR_SPACE_RGB // ILI9488 is typically RGB
#define LCD_DRIVER_FN()    esp_lcd_new_panel_ili9488(io_handle, &panel_config, &panel_handle)

//RGB Display Pinout

#define LCD_COLOR_BYTES_PER_PIXEL 2 // Using 16-bit RGB565 for simpler pinout
#define LCD_INIT_BUFFER_SIZE 2048 // 2KB is usually more than enough for init commands
#define FRAME_BUFFER_SIZE (LCD_H_RES * LCD_V_RES * 2)

// --- GPIO PIN DEFINITIONS ---

// 1. Pins Freed for I2S/SDIO (DO NOT USE THESE BELOW)
// I2S: GPIO 40, 41, 42 | SDIO: GPIO 1, 5, 6, 7, 8, 9
// We will define them later, but they are reserved here.

// --- 1. I2S Audio Pin Definitions (FINAL MOVE) ---
#define I2S_PIN_NUM_BCLK      1
#define I2S_PIN_NUM_LRCK      2
#define I2S_PIN_NUM_DOUT      46      // Moved to 46 to free up 3 and 4

// --- 2. SD Card (SDIO 4-bit) Pin Definitions ---
#define SDIO_PIN_NUM_CLK      5
#define SDIO_PIN_NUM_CMD      6
#define SDIO_PIN_NUM_D0       7
#define SDIO_PIN_NUM_D1       8
#define SDIO_PIN_NUM_D2       9
#define SDIO_PIN_NUM_D3       10

// --- 3. SPI Pins for ILI9488 Initialization ---
#define LCD_PIN_NUM_SPI_CS    11
#define LCD_PIN_NUM_SPI_SCLK  12
#define LCD_PIN_NUM_SPI_MOSI  13
#define LCD_PIN_NUM_SPI_DC    10      // Safest choice for Data/Command

// --- 4. General Control Pin Definitions ---
#define LCD_PIN_NUM_RST       14
#define LCD_PIN_NUM_BK_LIGHT  15

// --- 5. RGB Interface Pins for DISPLAY (SYNC LINES) ---
#define LCD_PIN_NUM_PCLK      1
#define LCD_PIN_NUM_HSYNC     0
#define LCD_PIN_NUM_VSYNC     45
#define LCD_PIN_NUM_DE        47

// --- 6. RGB Data Bus (D0-D15) - FINAL, VERIFIED PINS ---
// Low Byte (D0-D7)
#define LCD_PIN_NUM_D0        20
#define LCD_PIN_NUM_D1        21
#define LCD_PIN_NUM_D2        16      // Remapped from 23
#define LCD_PIN_NUM_D3        17      // Remapped from 25
#define LCD_PIN_NUM_D4        18      // Remapped from 26
#define LCD_PIN_NUM_D5        19      // Remapped from 27
#define LCD_PIN_NUM_D6        4       // Remapped from 33 (New location!)
#define LCD_PIN_NUM_D7        3       // Remapped from 34 (New location!)

// High Byte (D8-D15)
#define LCD_PIN_NUM_D8        7
#define LCD_PIN_NUM_D9        8
#define LCD_PIN_NUM_D10       9
#define LCD_PIN_NUM_D11       38
#define LCD_PIN_NUM_D12       39
#define LCD_PIN_NUM_D13       40
#define LCD_PIN_NUM_D14       41
#define LCD_PIN_NUM_D15       42
// --- 6. RGB Data Bus (D16, D17) - NEW 18-BIT LINES ---
#define LCD_PIN_NUM_D16       5       // LCD Pin: D16
#define LCD_PIN_NUM_D17       6       // LCD Pin: D17

// NOTE: Please carefully check your specific ESP32-S3 module's pinout.
// GPIOs 22, 24, and 28-32 are often not available. The example above is
// adjusted to skip these unavailable pins, creating the 16-pin bus.

// IMPORTANT: LCD timing parameters for ILI9488
// These are typical values, but you MUST verify them with your datasheet.
#define LCD_PCLK_HZ          (6 * 1000 * 1000) // 6MHz for 480x320
// Increase the timing margins (Porches)
#define LCD_HSYNC_PULSE_WIDTH       5
#define LCD_HSYNC_BACK_PORCH        20 // Increased from 8
#define LCD_HSYNC_FRONT_PORCH       20 // Increased from 10

#define LCD_VSYNC_PULSE_WIDTH       5
#define LCD_VSYNC_BACK_PORCH        20 // Increased from 8
#define LCD_VSYNC_FRONT_PORCH       20 // Increased from 10

// --- Global Variable Definitions ---

int32_t g_last_x = 0;
int32_t g_last_y = 0;
lv_indev_state_t g_last_state = LV_INDEV_STATE_REL; // Start as Released
SemaphoreHandle_t g_touch_mutex = NULL; // Initialize to NULL or create in init()

const int DISPLAY_HORIZONTAL_PIXELS = 320;
const int DISPLAY_VERTICAL_PIXELS = 480;
const int DISPLAY_COMMAND_BITS = 8;
const int DISPLAY_PARAMETER_BITS = 8;
const unsigned int DISPLAY_REFRESH_HZ = 40000000;
const int DISPLAY_SPI_QUEUE_LEN = 10;
const int SPI_MAX_TRANSFER_SIZE = 32768;

// Note: You can switch this logic based on your build flags as before
const lcd_rgb_element_order_t TFT_COLOR_MODE = COLOR_RGB_ELEMENT_ORDER_RGB;

// Default to 25 lines of color data
const size_t LV_BUFFER_SIZE = 320 * 25; // DISPLAY_HORIZONTAL_PIXELS * 25
const int LVGL_UPDATE_PERIOD_MS = 5;

/*
const ledc_mode_t BACKLIGHT_LEDC_MODE = LEDC_LOW_SPEED_MODE;
const ledc_channel_t BACKLIGHT_LEDC_CHANNEL = LEDC_CHANNEL_0;
const ledc_timer_t BACKLIGHT_LEDC_TIMER = LEDC_TIMER_1;
const ledc_timer_bit_t BACKLIGHT_LEDC_TIMER_RESOLUTION = LEDC_TIMER_10_BIT;
const uint32_t BACKLIGHT_LEDC_FRQUENCY = 5000;
*/

esp_lcd_panel_io_handle_t lcd_io_handle = NULL;
esp_lcd_panel_handle_t lcd_handle = NULL;
lv_draw_buf_t lv_disp_buf;
lv_display_t *lv_display = NULL;
lv_color_t *lv_buf_1 = NULL;
lv_color_t *lv_buf_2 = NULL;
lv_obj_t *meter = NULL;
lv_style_t style_screen;


// Place this outside of app_main
void lcd_cmd(spi_device_handle_t spi, const uint8_t cmd)
{
    // Ensure DC is LOW for command (0)
    gpio_set_level(LCD_PIN_NUM_SPI_DC, 0);
    
    // Create the transaction configuration
    spi_transaction_t t = {
        .length = 8, // 8 bits long
        .tx_buffer = &cmd,
    };
    // Send the command
    spi_device_transmit(spi, &t);
}

