playrinc/FreeOS/main/ESP32Support.c
void lcd_data(spi_device_handle_t spi, const uint8_t *data, int len)
{
    if (len == 0) return;
    // Ensure DC is HIGH for data (1)
    gpio_set_level(LCD_PIN_NUM_SPI_DC, 1);
    
    // Create the transaction configuration
    spi_transaction_t t = {
        .length = len * 8, // length is in bits
        .tx_buffer = data,
    };
    // Send the data
    spi_device_transmit(spi, &t);
}

// Function to send a single command followed by a single parameter
void ili9488_set_colmod(spi_device_handle_t spi)
{
    const uint8_t cmd_colmod = 0x3A; // Command to set pixel format
    const uint8_t param_rgb565 = 0x55; // Parameter for 16-bit (RGB565)

    // 1. Send the command (DC=0)
    lcd_cmd(spi, cmd_colmod);
    
    // 2. Send the parameter (DC=1)
    lcd_data(spi, &param_rgb565, 1);
}

// --- ILI9488 Command Definitions (MUST be visible to the array) ---

#define ILI9488_SWRESET      0x01
#define ILI9488_SLPOUT       0x11
#define ILI9488_DISPON       0x29
#define ILI9488_PIXFMT       0x3A

#define ILI9488_FRMCTR1      0xB1
#define ILI9488_INVCTR       0xB4
#define ILI9488_DFUNCTR      0xB6

#define ILI9488_PWCTR1       0xC0
#define ILI9488_PWCTR2       0xC1
#define ILI9488_VMCTR1       0xC5

#define ILI9488_GMCTRP1      0xE0
#define ILI9488_GMCTRN1      0xE1
#define ILI9488_IMGFUNCT     0xE9

#define ILI9488_ADJCTR3      0xF7

// Commands used in your array (from the STM32 source):
#define ILI9488_GMCTRP1      0xE0
#define ILI9488_GMCTRN1      0xE1
#define ILI9488_PWCTR1       0xC0
#define ILI9488_PWCTR2       0xC1
#define ILI9488_VMCTR1       0xC5
#define ILI9488_PIXFMT       0x3A
#define ILI9488_FRMCTR1      0xB1
#define ILI9488_INVCTR       0xB4
#define ILI9488_DFUNCTR      0xB6
#define ILI9488_IMGFUNCT     0xE9
#define ILI9488_ADJCTR3      0xF7
#define ILI9488_SLPOUT       0x11
#define ILI9488_DISPON       0x29
#define ILI9488_SWRESET      0x01

// Adapt the command list from the STM32 driver (ili9488_Init function)
static const uint8_t ili9488_rgb_init_sequence[][20] = {
    // Command, Parameter1, Parameter2, ...
    { ILI9488_SWRESET, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0x01: SWRESET (No params, but needs delay)
    { ILI9488_GMCTRP1, 0x00, 0x01, 0x02, 0x04, 0x14, 0x09, 0x3F, 0x57, 0x4D, 0x05, 0x0B, 0x09, 0x1A, 0x1D, 0x0F }, // 0xE0: Positive Gamma Control (15 params)
    { ILI9488_GMCTRN1, 0x00, 0x1D, 0x20, 0x02, 0x0E, 0x03, 0x35, 0x12, 0x47, 0x02, 0x0D, 0x0C, 0x38, 0x39, 0x0F }, // 0xE1: Negative Gamma Control (15 params)
    { ILI9488_PWCTR1, 0x17, 0x15, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0xC0: Power Control 1 (2 params)
    { ILI9488_PWCTR2, 0x41, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0xC1: Power Control 2 (1 param)
    { ILI9488_VMCTR1, 0x00, 0x12, 0x80, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0xC5: VCOM Control (3 params)
    
    // *** CRITICAL CHANGE ***
    // 0x3A: PIXFMT. Must be 0x55 for 16-bit RGB565.
    { ILI9488_PIXFMT, 0x55, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0x3A: Interface Pixel Format (1 param)

    // 0xB0: Interface Mode Control. We need to set the parallel mode bits, which is NOT 0x80/0x00.
    // The ILI9488 requires different commands for DPI (Parallel RGB) vs. MCU (8080/DPI) mode.
    // We will use 0x02 (which enables the DPI) or 0x03 (for 16-bit DPI). This depends on hardware. Let's try 0x00 (the standard reset state)
    // and rely on the RGB panel to set the mode, but it might need 0x02.
    // Since the driver failed to set this, let's skip it and focus on the power-up sequence.

    { ILI9488_FRMCTR1, 0xA0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0xB1: Frame rate (1 param)
    { ILI9488_INVCTR, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0xB4: Display Inversion Control (1 param)
    { ILI9488_DFUNCTR, 0x02, 0x02, 0x3B, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0xB6: Display Function Control (3 params)
    { ILI9488_IMGFUNCT, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0xE9: Set Image Function (1 param)
    { ILI9488_ADJCTR3, 0xA9, 0x51, 0x2C, 0x82, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0xF7: Adjust Control (4 params)
    
    // **Final Wake-up**
    { ILI9488_SLPOUT, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0x11: Exit Sleep (Needs 120ms delay)
    { ILI9488_DISPON, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 }, // 0x29: Display ON (Needs 5ms delay)
};



void initRgbDisplay(void) {
    // --- Part 1: Initialize Backlight ---
        FreeOSLogI(TAG, "Initializing LCD backlight on GPIO %d...", LCD_PIN_NUM_BK_LIGHT);
        // ... (Backlight setup code remains the same)
        gpio_config_t bk_gpio_conf = {
            .pin_bit_mask = 1ULL << LCD_PIN_NUM_BK_LIGHT,
            .mode = GPIO_MODE_OUTPUT,
        };
        ESP_ERROR_CHECK(gpio_config(&bk_gpio_conf));
        gpio_set_level(LCD_PIN_NUM_BK_LIGHT, 1);

        // --- Part 2: Initialize ILI9488 via temporary SPI bus ---
        FreeOSLogI(TAG, "Installing temporary SPI bus for ILI9488 init...");
        spi_bus_config_t buscfg = {
            .mosi_io_num = LCD_PIN_NUM_SPI_MOSI,
            .sclk_io_num = LCD_PIN_NUM_SPI_SCLK,
            .miso_io_num = -1,
            .quadwp_io_num = -1,
            .quadhd_io_num = -1,
            .max_transfer_sz = LCD_H_RES * 10, // Small transfer size for commands
        };
        ESP_ERROR_CHECK(spi_bus_initialize(SPI2_HOST, &buscfg, SPI_DMA_CH_AUTO));

        esp_lcd_panel_io_handle_t io_handle = NULL;
        esp_lcd_panel_io_spi_config_t io_config = {
            .cs_gpio_num = LCD_PIN_NUM_SPI_CS,
            .dc_gpio_num = LCD_PIN_NUM_SPI_DC,
            .spi_mode = 0,
            .pclk_hz = 10 * 1000 * 1000,
            .trans_queue_depth = 10,
            .lcd_cmd_bits = 8,
            .lcd_param_bits = 8,
        };
        ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)SPI2_HOST, &io_config, &io_handle));

    FreeOSLogI(TAG, "Installing ILI9488 driver over SPI...");
        esp_lcd_panel_handle_t init_panel_handle = NULL;
        esp_lcd_panel_dev_config_t panel_config = {
            .reset_gpio_num = LCD_PIN_NUM_RST,
            .bits_per_pixel = 16,
        };

