playrinc/FreeOS/main/ESP32Support.c
        ESP_ERROR_CHECK(esp_lcd_new_panel_ili9488(io_handle,
                                                  &panel_config,
                                                  LCD_INIT_BUFFER_SIZE, // <--- NEW ARGUMENT
                                                  &init_panel_handle));

        FreeOSLogI(TAG, "Resetting and Initializing ILI9488...");
        ESP_ERROR_CHECK(esp_lcd_panel_reset(init_panel_handle));
        ESP_ERROR_CHECK(esp_lcd_panel_init(init_panel_handle));

        // Optional: Set the ILI9488 to accept RGB565 (16-bit) data
        // Command 0x3A is COLMOD (Pixel Format). 0x55 is 16-bit (RGB565).
        esp_lcd_panel_io_tx_param(io_handle, 0x3A, (uint8_t[]){0x55}, 1);

        // Disable SPI interface
        FreeOSLogI(TAG, "Initialization complete. Deleting SPI handles...");
        ESP_ERROR_CHECK(esp_lcd_panel_del(init_panel_handle));
        ESP_ERROR_CHECK(esp_lcd_panel_io_del(io_handle));
        ESP_ERROR_CHECK(spi_bus_free(SPI2_HOST));


        // --- Part 3: Install the permanent RGB interface ---
        FreeOSLogI(TAG, "Installing RGB panel driver for ILI9488...");
        esp_lcd_rgb_panel_config_t rgb_config = {
            .clk_src = LCD_CLK_SRC_DEFAULT,
            .disp_gpio_num = -1,
            .psram_trans_align = 64,
            .data_width = 16, // Use 16-bit bus
            .bits_per_pixel = 16,
            .de_gpio_num = LCD_PIN_NUM_DE,
            .pclk_gpio_num = LCD_PIN_NUM_PCLK,
            .vsync_gpio_num = LCD_PIN_NUM_VSYNC,
            .hsync_gpio_num = LCD_PIN_NUM_HSYNC,
            .data_gpio_nums = {
                LCD_PIN_NUM_D0, LCD_PIN_NUM_D1, LCD_PIN_NUM_D2, LCD_PIN_NUM_D3,
                LCD_PIN_NUM_D4, LCD_PIN_NUM_D5, LCD_PIN_NUM_D6, LCD_PIN_NUM_D7,
                LCD_PIN_NUM_D8, LCD_PIN_NUM_D9, LCD_PIN_NUM_D10, LCD_PIN_NUM_D11,
                LCD_PIN_NUM_D12, LCD_PIN_NUM_D13, LCD_PIN_NUM_D14, LCD_PIN_NUM_D15,
            },
            .timings = {
                .pclk_hz = LCD_PCLK_HZ,
                .h_res = LCD_H_RES,
                .v_res = LCD_V_RES,
                .flags.pclk_active_neg = true,  // TRY THIS AGAIN! Inverting the clock edge
                .flags.vsync_idle_low = false,  // Standard for VSYNC (try swapping if needed)
                .flags.hsync_idle_low = false,  // Standard for HSYNC (try swapping if needed)
                .hsync_pulse_width = LCD_HSYNC_PULSE_WIDTH,
                .hsync_back_porch = LCD_HSYNC_BACK_PORCH,
                .hsync_front_porch = LCD_HSYNC_FRONT_PORCH,
                .vsync_pulse_width = LCD_VSYNC_PULSE_WIDTH,
                .vsync_back_porch = LCD_VSYNC_BACK_PORCH,
                .vsync_front_porch = LCD_VSYNC_FRONT_PORCH,
            },
            .flags.fb_in_psram = true,
        };
        esp_lcd_panel_handle_t rgb_panel_handle = NULL;
        ESP_ERROR_CHECK(esp_lcd_new_rgb_panel(&rgb_config, &rgb_panel_handle));
        ESP_ERROR_CHECK(esp_lcd_panel_init(rgb_panel_handle));
        // Set the ILI9488 to accept RGB565 (16-bit) data
        // Command 0x3A is COLMOD (Pixel Format). 0x55 is 16-bit (RGB565).
        //esp_lcd_panel_io_tx_param(io_handle, 0x3A, (uint8_t[]){0x55}, 1);
        //ESP_ERROR_CHECK(esp_lcd_panel_io_tx_param(io_handle, 0x29, NULL, 0));
    
    // Inside app_main, before calling esp_lcd_new_panel_ili9488:


    /// --- Part 2: Initialize ILI9488 via temporary SPI bus (Corrected Order) ---
    
    // 1. Define the physical bus GPIOs
    spi_bus_config_t buscfg1 = {
        .mosi_io_num = LCD_PIN_NUM_SPI_MOSI,
        .sclk_io_num = LCD_PIN_NUM_SPI_SCLK,
        .miso_io_num = -1, // Not needed for write-only
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 1024,
    };
    
    // Line 1: Initialize the physical bus and pins (This was missing or misplaced!)
    FreeOSLogI(TAG, "Initializing SPI bus host...");
    ESP_ERROR_CHECK(spi_bus_initialize(SPI2_HOST, &buscfg1, SPI_DMA_CH_AUTO));

    // 2. Define the device configuration
    spi_device_handle_t raw_spi_handle = NULL;
    spi_device_interface_config_t devcfg={
        .clock_speed_hz = 10 * 1000 * 1000,
        .mode = 0,
        .spics_io_num = LCD_PIN_NUM_SPI_CS,
        .queue_size = 7,
        .pre_cb = NULL,
    };
    
    // Line 2: Add the device to the now-initialized bus
    FreeOSLogI(TAG, "Adding ILI9488 device to bus...");
    ESP_ERROR_CHECK(spi_bus_add_device(SPI2_HOST, &devcfg, &raw_spi_handle)); // Your crash line (now fixed)
    
    // 3. Manually send the required commands
    // Ensure the DC pin (GPIO 8) is configured as output before this line!
    gpio_set_direction(LCD_PIN_NUM_SPI_DC, GPIO_MODE_OUTPUT);
    
    FreeOSLogI(TAG, "Manually setting 16-bit color format...");
    ili9488_set_colmod(raw_spi_handle); // This command should now execute!

    // ... continue with esp_lcd_new_panel_ili9488 call, etc.

        // Manually run the hardware reset (already working, but cleaner here)
        // Assuming GPIO 14 is your reset pin
        gpio_set_level(LCD_PIN_NUM_RST, 0);
        vTaskDelay(pdMS_TO_TICKS(10));
        gpio_set_level(LCD_PIN_NUM_RST, 1);
        vTaskDelay(pdMS_TO_TICKS(120));

        FreeOSLogI(TAG, "Starting full ILI9488 init sequence...");

        for (int i = 0; i < sizeof(ili9488_rgb_init_sequence) / sizeof(ili9488_rgb_init_sequence[0]); i++) {
            uint8_t cmd = ili9488_rgb_init_sequence[i][0];
            const uint8_t *data = &ili9488_rgb_init_sequence[i][1];
            // Calculate length based on known commands or hardcoding
            int len = 0;
            if (cmd == ILI9488_GMCTRP1 || cmd == ILI9488_GMCTRN1) len = 15;
            else if (cmd == ILI9488_PWCTR1) len = 2;
            else if (cmd == ILI9488_VMCTR1) len = 3;
            else if (cmd == ILI9488_ADJCTR3) len = 4;
            else if (cmd == ILI9488_DFUNCTR) len = 2; // Adjusted from 3 to 2 based on pattern
            else if (cmd == ILI9488_PWCTR2 || cmd == ILI9488_PIXFMT || cmd == ILI9488_FRMCTR1 || cmd == ILI9488_INVCTR || cmd == ILI9488_IMGFUNCT) len = 1;

