playrinc/FreeOS/main/ESP32Support.c
            if (cmd == ILI9488_SWRESET) {
                lcd_cmd(raw_spi_handle, cmd);
                vTaskDelay(pdMS_TO_TICKS(5));
            } else if (cmd == ILI9488_SLPOUT) {
                lcd_cmd(raw_spi_handle, cmd);
                vTaskDelay(pdMS_TO_TICKS(120));
            } else if (cmd == ILI9488_DISPON) {
                lcd_cmd(raw_spi_handle, cmd);
                vTaskDelay(pdMS_TO_TICKS(5));
            } else {
                lcd_cmd(raw_spi_handle, cmd);
                if (len > 0) {
                    lcd_data(raw_spi_handle, data, len);
                }
            }
        }

        FreeOSLogI(TAG, "ILI9488 is now configured.");

    // ... (Proceed to delete SPI handles and initialize esp_lcd_new_panel_rgb) ...
    
        // --- Part 4: Draw to the "live" framebuffer ---
        uint16_t *framebuffer1 = NULL;
        ESP_ERROR_CHECK(esp_lcd_rgb_panel_get_frame_buffer(rgb_panel_handle, 1, (void **)&framebuffer1));

        FreeOSLogI(TAG, "Drawing solid green to the %dx%d framebuffer...", LCD_H_RES, LCD_V_RES);
        uint16_t green_color = 0x07E0; // RGB565: 00000 111111 00000 (Pure Green)
        for (int i = 0; i < LCD_H_RES * LCD_V_RES; i++) {
            framebuffer1[i] = green_color;
        }
        FreeOSLogI(TAG, "Display should be green and refreshed by hardware.");
}

// Add this near the top of your file
static void lvgl_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map);



/**
 * @brief DMA callback for esp_lcd.
 * This function is called from an ISR when the SPI transfer is done.
 */
static bool notify_lvgl_flush_ready(esp_lcd_panel_io_handle_t panel_io,
                                    esp_lcd_panel_io_event_data_t *edata,
                                    void *user_ctx)
{
    // user_ctx is the address of the global lv_display pointer (&lv_display)
    lv_display_t **disp_ptr = (lv_display_t **)user_ctx;
    lv_display_t *disp = *disp_ptr;
    
    // Check if LVGL has created the display object yet
    if (disp) {
        // Tell LVGL that the buffer flushing is complete
        lv_display_flush_ready(disp);
    }
    
    // Return false, indicating no high-priority task was woken.
    return false;
}


static void lvgl_flush_cb(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
    esp_lcd_panel_handle_t panel_handle = (esp_lcd_panel_handle_t)lv_display_get_user_data(disp);
    
    int offsetx1 = area->x1;
    int offsetx2 = area->x2;
    int offsety1 = area->y1;
    int offsety2 = area->y2;
    // Change line 165 to this:
    esp_lcd_panel_draw_bitmap(panel_handle, offsetx1, offsety1, offsetx2 + 1, offsety2 + 1, px_map);
    // At the very end, tell LVGL you are done
    lv_display_flush_ready(disp);
}

static void IRAM_ATTR lvgl_tick_cb(void *param)
{
    lv_tick_inc(LVGL_UPDATE_PERIOD_MS);
}

/*static void display_brightness_init(void)
 {
 const ledc_channel_config_t LCD_backlight_channel =
 {
 .gpio_num = GPIO_NUM_NC,
 .speed_mode = BACKLIGHT_LEDC_MODE,
 .channel = BACKLIGHT_LEDC_CHANNEL,
 .intr_type = LEDC_INTR_DISABLE,
 .timer_sel = BACKLIGHT_LEDC_TIMER,
 .duty = 0,
 .hpoint = 0,
 .flags =
 {
 .output_invert = 0
 }
 };
 const ledc_timer_config_t LCD_backlight_timer =
 {
 .speed_mode = BACKLIGHT_LEDC_MODE,
 .duty_resolution = BACKLIGHT_LEDC_TIMER_RESOLUTION,
 .timer_num = BACKLIGHT_LEDC_TIMER,
 .freq_hz = BACKLIGHT_LEDC_FRQUENCY,
 .clk_cfg = LEDC_AUTO_CLK
 };
 FreeOSLogI(TAG, "Initializing LEDC for backlight pin: %d", GPIO_NUM_NC);
 
 ESP_ERROR_CHECK(ledc_timer_config(&LCD_backlight_timer));
 ESP_ERROR_CHECK(ledc_channel_config(&LCD_backlight_channel));
 }
 
 void display_brightness_set(int brightness_percentage)
 {
 if (brightness_percentage > 100)
 {
 brightness_percentage = 100;
 }
 else if (brightness_percentage < 0)
 {
 brightness_percentage = 0;
 }
 FreeOSLogI(TAG, "Setting backlight to %d%%", brightness_percentage);
 
 // LEDC resolution set to 10bits, thus: 100% = 1023
 uint32_t duty_cycle = (1023 * brightness_percentage) / 100;
 ESP_ERROR_CHECK(ledc_set_duty(BACKLIGHT_LEDC_MODE, BACKLIGHT_LEDC_CHANNEL, duty_cycle));
 ESP_ERROR_CHECK(ledc_update_duty(BACKLIGHT_LEDC_MODE, BACKLIGHT_LEDC_CHANNEL));
 }*/

void initialize_spi()
{
    FreeOSLogI(TAG, "Initializing SPI bus (MOSI:%d, MISO:%d, CLK:%d)",
             PIN_NUM_MOSI, GPIO_NUM_NC, PIN_NUM_CLK);
    spi_bus_config_t bus =
    {
        .mosi_io_num = PIN_NUM_MOSI,
        .miso_io_num = GPIO_NUM_NC,
        .sclk_io_num = PIN_NUM_CLK,
        .quadwp_io_num = GPIO_NUM_NC,
        .quadhd_io_num = GPIO_NUM_NC,
        .data4_io_num = GPIO_NUM_NC,
        .data5_io_num = GPIO_NUM_NC,
        .data6_io_num = GPIO_NUM_NC,
        .data7_io_num = GPIO_NUM_NC,
        .max_transfer_sz = SPI_MAX_TRANSFER_SIZE,
        .flags = SPICOMMON_BUSFLAG_SCLK |
        SPICOMMON_BUSFLAG_MOSI | SPICOMMON_BUSFLAG_MASTER,
            .intr_flags = ESP_INTR_FLAG_LOWMED | ESP_INTR_FLAG_IRAM
    };
    
    ESP_ERROR_CHECK(spi_bus_initialize(SPI2_HOST, &bus, SPI_DMA_CH_AUTO));
}

// The global semaphore flag
SemaphoreHandle_t lcd_flush_ready_sem = NULL;

// The new FreeOS callback to replace the LVGL one
static bool lcd_trans_done_cb(esp_lcd_panel_io_handle_t panel_io, esp_lcd_panel_io_event_data_t *edata, void *user_ctx) {
    BaseType_t need_yield = pdFALSE;
    if (lcd_flush_ready_sem) {
        xSemaphoreGiveFromISR(lcd_flush_ready_sem, &need_yield);
    }
    return (need_yield == pdTRUE);
}

void initialize_display()
{
    
    if (lcd_flush_ready_sem == NULL) {
            lcd_flush_ready_sem = xSemaphoreCreateBinary();
            xSemaphoreGive(lcd_flush_ready_sem); // Initialize it as "ready"
        }
    
    
    const esp_lcd_panel_io_spi_config_t io_config =
    {
        .cs_gpio_num = PIN_NUM_CS,
        .dc_gpio_num = PIN_NUM_DC,
        .spi_mode = 0,
        .pclk_hz = DISPLAY_REFRESH_HZ,
        .trans_queue_depth = DISPLAY_SPI_QUEUE_LEN,
        .on_color_trans_done = lcd_trans_done_cb,
        .user_ctx = NULL,
        .lcd_cmd_bits = DISPLAY_COMMAND_BITS,
        .lcd_param_bits = DISPLAY_PARAMETER_BITS,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5,4,0)
        .cs_ena_pretrans = 0,
        .cs_ena_posttrans = 0,
#endif
        .flags =
        {
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
            .dc_as_cmd_phase = 0,
            .dc_low_on_data = 0,
            .octal_mode = 0,
            .lsb_first = 0
#else
                .dc_low_on_data = 0,
                .octal_mode = 0,
                .sio_mode = 0,
                .lsb_first = 0,
                .cs_high_active = 0
#endif
        }
    };
    
    const esp_lcd_panel_dev_config_t lcd_config =
    {
        .reset_gpio_num = PIN_NUM_RST,
        .color_space = TFT_COLOR_MODE,
        .bits_per_pixel = 18,
        .flags =
        {
            .reset_active_high = 0
        },
            .vendor_config = NULL
    };
    
