playrinc/FreeOS/main/ESP32Support.c
    ESP_ERROR_CHECK(
                    esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)SPI2_HOST, &io_config, &lcd_io_handle));
    
    ESP_ERROR_CHECK(esp_lcd_new_panel_ili9488(lcd_io_handle, &lcd_config, LV_BUFFER_SIZE, &lcd_handle));
    
    ESP_ERROR_CHECK(esp_lcd_panel_reset(lcd_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_init(lcd_handle));
    ESP_ERROR_CHECK(esp_lcd_panel_invert_color(lcd_handle, true));
    ESP_ERROR_CHECK(esp_lcd_panel_swap_xy(lcd_handle, false));
    ESP_ERROR_CHECK(esp_lcd_panel_mirror(lcd_handle, false, false));
    ESP_ERROR_CHECK(esp_lcd_panel_set_gap(lcd_handle, 0, 0));
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
    ESP_ERROR_CHECK(esp_lcd_panel_disp_off(lcd_handle, false));
#else
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(lcd_handle, true));
#endif
}

void initialize_lvgl()
{
    FreeOSLogI(TAG, "Initializing LVGL");
    lv_init();
    
    FreeOSLogI(TAG, "Allocating LVGL draw buffers");
    lv_buf_1 = (lv_color_t *)heap_caps_malloc(LV_BUFFER_SIZE * sizeof(lv_color_t), MALLOC_CAP_DMA);
    assert(lv_buf_1);
#if USE_DOUBLE_BUFFERING
    lv_buf_2 = (lv_color_t *)heap_caps_malloc(LV_BUFFER_SIZE * sizeof(lv_color_t), MALLOC_CAP_DMA);
    assert(lv_buf_2);
#endif
    
    FreeOSLogI(TAG, "Creating LVGL display");
    // --- THIS IS THE NEW V9 DRIVER SETUP ---
    
    // 1. Create a display
    lv_display = lv_display_create(DISPLAY_HORIZONTAL_PIXELS, DISPLAY_VERTICAL_PIXELS);
    
    lv_display_set_buffers(lv_display,
                           lv_buf_1,
                           lv_buf_2,
                           LV_BUFFER_SIZE,
                           LV_DISPLAY_RENDER_MODE_PARTIAL);
    
    // 4. Set the flush callback
    lv_display_set_flush_cb(lv_display, lvgl_flush_cb);
    
    // 5. Pass your 'lcd_handle' (panel handle) to the display's user data
    lv_display_set_user_data(lv_display, lcd_handle);
    
    // --- END OF NEW V9 SETUP ---
    
    
    FreeOSLogI(TAG, "Creating LVGL tick timer");
    const esp_timer_create_args_t lvgl_tick_timer_args =
    {
        .callback = &lvgl_tick_cb,
        .name = "lvgl_tick"
    };
    esp_timer_handle_t lvgl_tick_timer = NULL;
    ESP_ERROR_CHECK(esp_timer_create(&lvgl_tick_timer_args, &lvgl_tick_timer));
    ESP_ERROR_CHECK(esp_timer_start_periodic(lvgl_tick_timer, LVGL_UPDATE_PERIOD_MS * 1000));
}

static void lvgl_task_handler(void *pvParameters)
{
    FreeOSLogI(TAG, "Starting LVGL task handler");
    while (1)
    {
        // Run the LVGL timer handler
        // This function will block for the appropriate amount of time
        // based on the timers you have set up in LVGL.
        lv_timer_handler();
        
        // Delay for a short period to yield to other tasks.
        // 10ms is a common value.
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

// --- Configuration for ST7789 ---
#elif defined(USE_ST7789)
#define LCD_PIXEL_CLOCK_HZ (40 * 1000 * 1000) // You can use 40MHz for ST7789 too
#define LCD_H_RES          320
#define LCD_V_RES          240
#define LCD_COLOR_SPACE    ESP_LCD_COLOR_SPACE_BGR // ST7789 is often BGR
#define LCD_DRIVER_FN()    esp_lcd_new_panel_st7789(io_handle, &panel_config, &panel_handle)

// --- Error if no display is selected ---
#else
#error "No display driver selected. Please define USE_ILI9488 or USE_ST7789."
#endif


#define LCD_COLOR_RED       0xF800 // RGB565 code for Red

// Global panel handle (needed for the drawing function)
esp_lcd_panel_handle_t panel_handle = NULL;

static bool usingSt7789 = false;

//Touch

static esp_lcd_touch_handle_t tp_handle = NULL; // Touch panel handle
static lv_indev_t *lvgl_touch_indev = NULL;     // LVGL input device

/**
 * @brief LVGL input device "read" callback.
 * This function is called by LVGL periodically to get the current touch state.
 */
/*static void lvgl_touch_cb(lv_indev_t *indev, lv_indev_data_t *data)
 {
 // Get the touch handle stored in the input device's user_data
 esp_lcd_touch_handle_t tp = (esp_lcd_touch_handle_t)lv_indev_get_user_data(indev);
 
 // --- This is your code, now inside the callback ---
 uint16_t touch_x[1];
 uint16_t touch_y[1];
 uint16_t touch_strength[1];
 uint8_t touch_cnt = 0;
 
 // Poll the touch controller
 bool touchpad_pressed = esp_lcd_touch_get_coordinates(tp, touch_x, touch_y, touch_strength, &touch_cnt, 1);
 
 if (touchpad_pressed && touch_cnt > 0) {
 // A touch is detected
 data->state = LV_INDEV_STATE_PRESSED;
 data->point.x = touch_x[0];
 data->point.y = touch_y[0];
 } else {
 // No touch is detected
 data->state = LV_INDEV_STATE_RELEASED;
 }
 }*/

// --- Use the ESP32 pins from your code snippet ---
#define I2C_SDA_PIN 6
#define I2C_SCL_PIN 7
#define RST_N_PIN   4
#define INT_N_PIN   5

#define I2C_HOST I2C_NUM_0 // I2C port 0

// Global device handle
static ft6336u_dev_t touch_dev;
static i2c_master_bus_handle_t i2c_bus_handle;

// FreeRTOS queue to handle interrupt events
static QueueHandle_t touch_intr_queue = NULL;

/**
 * @brief Initialize the I2C master bus
 */
esp_err_t i2c_master_init(void) {
    i2c_master_bus_config_t i2c_bus_config = {
        .i2c_port = I2C_HOST,
        .sda_io_num = I2C_SDA_PIN,
        .scl_io_num = I2C_SCL_PIN,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .intr_priority = 0,
        .flags.enable_internal_pullup = true
    };
    
    esp_err_t ret = i2c_new_master_bus(&i2c_bus_config, &i2c_bus_handle);
    if (ret != ESP_OK) {
        FreeOSLogE(TAG, "Failed to create I2C master bus: %s", esp_err_to_name(ret));
    }
    return ret;
}


/*void lvgl_touch_read_cb(lv_indev_t *indev, lv_indev_data_t *data) {
 
 // --- LOCK ---
 xSemaphoreTake(g_touch_mutex, QUEUE_MAX_DELAY);
 
 // Read the shared variables
 FreeOSLogI(TAG, "lvgl_touch_read_cb");
 data->point.x = g_last_x;
 data->point.y = g_last_y;
 data->state = g_last_state;
 
 // --- UNLOCK ---
 xSemaphoreGive(g_touch_mutex);
 }*/

/*void lvgl_touch_read_cb(lv_indev_t *indev, lv_indev_data_t *data) {
 
 // Lock the mutex to check the state
 xSemaphoreTake(g_touch_mutex, QUEUE_MAX_DELAY);
 
 // --- This is the new logic ---
 
