playrinc/FreeOS/main/ESP32Support.c
 // 1. Check if a "press" event is waiting for us
 if (g_last_state == LV_INDEV_STATE_PR) {
 
 // It is. Report the press to LVGL.
 data->point.x = g_last_x;
 data->point.y = g_last_y;
 data->state = LV_INDEV_STATE_PR;
 
 // 2. IMPORTANT: Consume the event
 // We immediately set the global state back to "released".
 // This ensures LVGL only sees "PRESSED" for a single frame.
 g_last_state = LV_INDEV_STATE_REL;
 
 } else {
 // No new press event. Just report "released".
 data->state = LV_INDEV_STATE_REL;
 }
 
 // --- Unlock the mutex ---
 xSemaphoreGive(g_touch_mutex);
 }*/


/*void lvgl_touch_read_cb(lv_indev_t *indev, lv_indev_data_t *data) {
 
 // --- LOCK THE MUTEX ---
 xSemaphoreTake(g_touch_mutex, QUEUE_MAX_DELAY);
 
 // --- THIS IS THE FIX ---
 
 // 1. Check if a "press" event is waiting for us
 if (g_last_state == LV_INDEV_STATE_PR) {
 
 // It is. Report the press to LVGL.
 data->point.x = g_last_x;
 data->point.y = g_last_y;
 data->state = LV_INDEV_STATE_PR;
 
 // 2. IMPORTANT: Consume the event
 // We immediately set the global state back to "released".
 // This ensures LVGL only sees "PRESSED" for a single frame.
 g_last_state = LV_INDEV_STATE_REL;
 
 } else {
 // No new press event. Just report "released".
 data->point.x = g_last_x; // Pass last-known coords
 data->point.y = g_last_y;
 data->state = LV_INDEV_STATE_REL;
 }
 
 // --- UNLOCK THE MUTEX ---
 xSemaphoreGive(g_touch_mutex);
 }*/

void lvgl_touch_read_cb(lv_indev_t *indev, lv_indev_data_t *data) {
    
    // Lock the mutex
    xSemaphoreTake(g_touch_mutex, QUEUE_MAX_DELAY);
    
    // --- This is the fix ---
    
    // 1. Check if a "press" event is waiting for us
    if (g_last_state == LV_INDEV_STATE_PR) {
        
        // It is. Report the press to LVGL.
        data->point.x = g_last_x;
        data->point.y = g_last_y;
        data->state = LV_INDEV_STATE_PR;
        
        // 2. IMPORTANT: Consume the event
        // We immediately set the global state back to "released".
        g_last_state = LV_INDEV_STATE_REL;
        
    } else {
        // No new press event. Just report "released".
        data->point.x = g_last_x;
        data->point.y = g_last_y;
        data->state = LV_INDEV_STATE_REL;
    }
    
    // Unlock the mutex
    xSemaphoreGive(g_touch_mutex);
}



/*void lvgl_touch_read_cb(lv_indev_t *indev, lv_indev_data_t *data) {
 
 FreeOSLogI(TAG, "lvgl_touch_read_cb");
 
 FT6336U_TouchPointType touch_data;
 
 // 1. Scan the touch controller
 esp_err_t ret = ft6336u_scan(&touch_dev, &touch_data);
 if (ret != ESP_OK) {
 FreeOSLogE(TAG, "Failed to scan touch: %s", esp_err_to_name(ret));
 // Keep last state if read fails
 data->state = LV_INDEV_STATE_REL;
 return;
 }
 
 // 2. Update LVGL with the new data
 if (touch_data.touch_count == 0) {
 data->state = LV_INDEV_STATE_REL; // Released
 } else {
 // Use the first touch point
 data->point.x = touch_data.tp[0].x;
 data->point.y = touch_data.tp[0].y;
 data->state = LV_INDEV_STATE_PR; // Pressed
 
 // Optional: Log if you still want to see coordinates
 // FreeOSLogI(TAG, "Touch 0: X=%u, Y=%u", data->point.x, data->point.y);
 }
 }*/

/*void updateTouch(void *pvParameter) {
 while (1) {
 FT6336U_TouchPointType touch_data;
 esp_err_t ret = ft6336u_scan(&touch_dev, &touch_data);
 
 // --- LOCK ---
 xSemaphoreTake(g_touch_mutex, QUEUE_MAX_DELAY);
 
 if (ret != ESP_OK) {
 g_last_state = LV_INDEV_STATE_REL;
 } else {
 if (touch_data.touch_count == 0) {
 g_last_state = LV_INDEV_STATE_REL;
 } else {
 g_last_x = touch_data.tp[0].x;
 g_last_y = touch_data.tp[0].y;
 g_last_state = LV_INDEV_STATE_PR;
 }
 }
 
 // --- UNLOCK ---
 xSemaphoreGive(g_touch_mutex);
 
 vTaskDelay(pdMS_TO_TICKS(20));
 }
 
 
 uint32_t event;
 FT6336U_TouchPointType touch_data;
 
 while (1) {
 // Wait for an interrupt event from the queue
 if (xQueueReceive(touch_intr_queue, &event, QUEUE_MAX_DELAY)) {
 g_last_state = LV_INDEV_STATE_REL;
 // Interrupt received, scan the touch controller
 esp_err_t ret = ft6336u_scan(&touch_dev, &touch_data);
 if (ret != ESP_OK) {
 FreeOSLogE(TAG, "Failed to scan touch: %s", esp_err_to_name(ret));
 g_last_state = LV_INDEV_STATE_REL;
 continue;
 }
 
 if (touch_data.touch_count == 0) {
 FreeOSLogI(TAG, "Touch Released");
 
 g_last_state = LV_INDEV_STATE_REL;
 } else {
 FreeOSLogI(TAG, "Touch Pressed");
 for (int i = 0; i < touch_data.touch_count; i++) {
 FreeOSLogI(TAG, "Touch %d: (%s) X=%u, Y=%u",
 i,
 (touch_data.tp[i].status == touch) ? "NEW" : "STREAM",
 touch_data.tp[i].x,
 touch_data.tp[i].y);
 }
 g_last_x = touch_data.tp[0].x;
 g_last_y = touch_data.tp[0].y;
 g_last_state = LV_INDEV_STATE_PR;
 
 }
 }
 }
 }*/



#define MP3_READ_BUF_SIZE 16*1024
#define PCM_BUF_SIZE 1152 * 2

// Volume (0-256)
static int current_volume = 256; // 50%

// --- AUDIO CONFIGURATION ---
#define SAMPLE_RATE     44100
#define WAVE_FREQ_HZ    440.0f
#define PI              3.14159265f

static i2s_chan_handle_t tx_handle = NULL;
static i2s_chan_handle_t rx_handle = NULL;

// --- HELPER: 16-bit Volume Control ---
void write_to_i2s_16bit(i2s_chan_handle_t handle, int16_t *pcm_samples, int sample_count) {
    size_t bytes_written;
    
    // Apply volume in place
    // We cast to int32_t temporarily to avoid overflow during multiplication
    for (int i = 0; i < sample_count; i++) {
        int32_t temp = (int32_t)pcm_samples[i] * current_volume;
        pcm_samples[i] = (int16_t)(temp >> 8); // Divide by 256 and cast back
    }

    // Write DIRECTLY to I2S (No 32-bit conversion needed)
    i2s_channel_write(handle, pcm_samples, sample_count * sizeof(int16_t), &bytes_written, QUEUE_MAX_DELAY);
}

void play_mp3_file(const char *filename, i2s_chan_handle_t tx_handle) {
    FILE *f = fopen(filename, "rb");
    if (!f) {
        printf("Failed to open file: %s\n", filename);
        return;
    }

    // --- CHANGE: Allocate in SPIRAM (PSRAM) ---
    // This moves ~4KB + ~4KB out of internal RAM
    uint8_t *read_buf = (uint8_t *)heap_caps_malloc(MP3_READ_BUF_SIZE, MALLOC_CAP_SPIRAM);
    int16_t *pcm_buf = (int16_t *)heap_caps_malloc(PCM_BUF_SIZE * sizeof(int16_t), MALLOC_CAP_SPIRAM);

    if (!read_buf || !pcm_buf) {
        printf("Failed to allocate SPIRAM memory! Is PSRAM enabled in menuconfig?\n");
        if (read_buf) free(read_buf);
        if (pcm_buf) free(pcm_buf);
        fclose(f);
        return;
    }

