playrinc/FreeOS/main/ESP32Support.c
    mp3dec_t mp3d;
    mp3dec_frame_info_t info;
    mp3dec_init(&mp3d);
    
    int bytes_in_buf = 0;
    int buf_offset = 0;

    while (1) {
        if (bytes_in_buf < MP3_READ_BUF_SIZE && !feof(f)) {
            if (bytes_in_buf > 0) {
                memmove(read_buf, read_buf + buf_offset, bytes_in_buf);
            }
            int bytes_read = fread(read_buf + bytes_in_buf, 1, MP3_READ_BUF_SIZE - bytes_in_buf, f);
            bytes_in_buf += bytes_read;
            buf_offset = 0;
            if (bytes_read == 0 && bytes_in_buf == 0) break;
        }

        int samples = mp3dec_decode_frame(&mp3d, read_buf + buf_offset, bytes_in_buf, pcm_buf, &info);
        
        buf_offset += info.frame_bytes;
        bytes_in_buf -= info.frame_bytes;

        if (samples > 0) {
            // Send 16-bit data
            write_to_i2s_16bit(tx_handle, pcm_buf, samples * info.channels);
        } else {
            if (bytes_in_buf > 0 && info.frame_bytes == 0) {
                buf_offset++;
                bytes_in_buf--;
            }
        }
    }

    free(read_buf);
    free(pcm_buf);
    fclose(f);
    printf("Playback finished.\n");
}

void mp3_task_wrapper(void *arg) {
    // We can pass the handle via valid logic, or just make tx_handle global
    play_mp3_file("/sdcard/frair.mp3", tx_handle);
    
    // Delete this task when song finishes so we don't crash
    vTaskDelete(NULL);
}

typedef struct {
    char riff_tag[4];       // "RIFF"
    uint32_t riff_len;      // Total file size - 8
    char wave_tag[4];       // "WAVE"
    char fmt_tag[4];        // "fmt "
    uint32_t fmt_len;       // 16 for PCM
    uint16_t audio_format;  // 1 for PCM
    uint16_t num_channels;  // 1 for Mono, 2 for Stereo
    uint32_t sample_rate;   // e.g., 44100
    uint32_t byte_rate;     // sample_rate * channels * (bit_depth/8)
    uint16_t block_align;   // channels * (bit_depth/8)
    uint16_t bits_per_sample; // 16
    char data_tag[4];       // "data"
    uint32_t data_len;      // Total bytes of audio data
} wav_header_t;

// Function to generate the header
void write_wav_header(FILE *f, int sample_rate, int channels, int total_data_len) {
    wav_header_t header;

    // RIFF Chunk
    memcpy(header.riff_tag, "RIFF", 4);
    header.riff_len = total_data_len + 36; // File size - 8
    memcpy(header.wave_tag, "WAVE", 4);

    // fmt Chunk
    memcpy(header.fmt_tag, "fmt ", 4);
    header.fmt_len = 16;
    header.audio_format = 1; // PCM
    header.num_channels = channels;
    header.sample_rate = sample_rate;
    header.bits_per_sample = 16;
    header.byte_rate = sample_rate * channels * (16 / 8);
    header.block_align = channels * (16 / 8);

    // data Chunk
    memcpy(header.data_tag, "data", 4);
    header.data_len = total_data_len;

    // Write header to beginning of file
    fseek(f, 0, SEEK_SET); // Jump to start
    fwrite(&header, sizeof(wav_header_t), 1, f);
    fseek(f, 0, SEEK_END); // Jump back to end
}

#define RECORD_TIME_SEC 10
#define SAMPLE_RATE 44100
#define CHANNELS 2      // We use Stereo mode in I2S, even if mic is mono
#define BIT_DEPTH 16

// Control Flags
static volatile bool is_recording_active = false;
static TaskHandle_t record_task_handle = NULL;

// Make sure your I2S RX Handle is global so the task can see it
// (Define this near your setupHybridAudio function)
extern i2s_chan_handle_t rx_handle;

void record_wav_task(void *args) {
    FreeOSLogI("REC", "Opening file for recording...");

    // 1. Open File
    FILE *f = fopen("/sdcard/recording.wav", "wb");
    if (f == NULL) {
        FreeOSLogE("REC", "Failed to open file!");
        is_recording_active = false;
        record_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }

    // 2. Write Placeholder Header
    wav_header_t dummy_header = {0};
    fwrite(&dummy_header, sizeof(wav_header_t), 1, f);

    // 3. Allocate Buffer
    size_t chunk_size = 4096;
    char *buffer = cc_safe_alloc(1, chunk_size);
    size_t bytes_read = 0;
    size_t total_bytes_recorded = 0;

    // 4. The Loop (Runs while is_recording_active is TRUE)
    while (is_recording_active) {
        // Read audio from I2S
        if (i2s_channel_read(rx_handle, buffer, chunk_size, &bytes_read, 100) == ESP_OK) {
            // Write audio to SD Card
            if (bytes_read > 0) {
                fwrite(buffer, 1, bytes_read, f);
                total_bytes_recorded += bytes_read;
            }
        } else {
            // Optional: Short delay to prevent watchdog starvation if I2S fails
            vTaskDelay(pdMS_TO_TICKS(10));
        }
    }

    // 5. Cleanup (The "Graceful" part)
    FreeOSLogI("REC", "Stopping... Finalizing WAV Header.");

    // Update the header with the correct file size
    write_wav_header(f, 44100, 2, total_bytes_recorded);

    fclose(f);
    free(buffer);
    
    FreeOSLogI("REC", "File saved. Task deleting.");
    record_task_handle = NULL; // Reset handle
    vTaskDelete(NULL);
}

void start_recording(void) {
    if (is_recording_active) {
        ESP_LOGW("REC", "Already recording!");
        return;
    }
    
    if (rx_handle == NULL) {
        FreeOSLogE("REC", "I2S RX Handle is NULL! Did you run setupHybridAudio?");
        return;
    }

    is_recording_active = true;
    
    FreeOSLogI("REC", "rec_task");
    
    // Create the task (Pinned to Core 1 is usually best for file I/O)
    xTaskCreatePinnedToCore(record_wav_task, "rec_task", 1024 * 6, NULL, 5, &record_task_handle, 1);
}

void stop_recording(void) {
    if (!is_recording_active) {
        return;
    }

    FreeOSLogI("REC", "Stop requested...");
    // Flip the switch. The task will exit its while() loop and clean up.
    is_recording_active = false;
}

void record_task(void *args) {
    // 1. Open File
    FILE *f = fopen("/sdcard/recording.wav", "wb");
    if (f == NULL) {
        FreeOSLogE("REC", "Failed to open file for writing");
        vTaskDelete(NULL);
    }

    // 2. Write Dummy Header (We will fix the sizes later)
    wav_header_t dummy_header = {0};
    fwrite(&dummy_header, sizeof(wav_header_t), 1, f);

    // 3. Allocation
    size_t bytes_read = 0;
    // Buffer size: 1024 samples * 2 channels * 2 bytes = 4096 bytes
    size_t chunk_size = 4096;
    char *buffer = cc_safe_alloc(1, chunk_size);
    
