playrinc/FreeOS/main/ESP32Support.c
    int total_bytes_recorded = 0;
    int expected_bytes = RECORD_TIME_SEC * SAMPLE_RATE * CHANNELS * (BIT_DEPTH/8);

    FreeOSLogI("REC", "Start Recording...");

    // 4. Recording Loop
    while (total_bytes_recorded < expected_bytes) {
        // Read from Microphone (I2S RX Handle)
        // Note: Use 'rx_handle' here, NOT tx_handle!
        if (i2s_channel_read(rx_handle, buffer, chunk_size, &bytes_read, 1000) == ESP_OK) {
            
            // Write Raw Data to SD Card
            fwrite(buffer, 1, bytes_read, f);
            total_bytes_recorded += bytes_read;
        }
    }

    FreeOSLogI("REC", "Recording Complete. Finalizing...");

    // 5. Finalize Header
    // Go back to the top of the file and write the correct lengths
    write_wav_header(f, SAMPLE_RATE, CHANNELS, total_bytes_recorded);

    // 6. Cleanup
    fclose(f);
    free(buffer);
    vTaskDelete(NULL);
}



void turn_off_wifi_and_free_ram(void) {
    ESP_LOGW("WIFI", "Shutting down Wi-Fi to reclaim RAM...");

    // 1. Stop the Wi-Fi Driver (Turns off Radio, saves power)
    // Memory is STILL allocated here.
    esp_err_t err = esp_wifi_stop();
    if (err == ESP_ERR_WIFI_NOT_INIT) {
        ESP_LOGW("WIFI", "Wi-Fi was not initialized, nothing to do.");
        return;
    }
    ESP_ERROR_CHECK(err);

    // 2. De-Initialize the Driver (The Magic Step)
    // This effectively "un-mallocs" the 60KB+ of Internal RAM.
    ESP_ERROR_CHECK(esp_wifi_deinit());

    // Optional: Destroy the default pointers if you created them
    // (This cleans up small remaining handles, but deinit does the heavy lifting)
    // esp_netif_destroy_default_wifi(your_netif_handle);

    ESP_LOGW("WIFI", "Wi-Fi De-initialized. RAM should be back.");
    
    // Prove it
    FreeOSLogI("MEM", "Free Internal Heap: %ld bytes", (long)heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
}

// 1. One-Time Initialization
// Call this inside app_main() BEFORE you show any UI!
void init_wifi_stack_once(void) {
    checkAvailableMemory();
    if (wifi_initialized) return; // Prevention

    // Initialize NVS (Required for WiFi)
   /* esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      ESP_ERROR_CHECK(nvs_flash_erase());
      ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);*/

    // Initialize Network Stack
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_t *sta_netif = esp_netif_create_default_wifi_sta();
    assert(sta_netif);

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    
    // 1. Slash the RX/TX Buffers (The biggest RAM savers)
    // Default is usually 32. We drop to 4-8.
    // Note: This might reduce max throughput speed, but fixes the crash.
    cfg.dynamic_rx_buf_num = 4;  // Minimum safe value
    cfg.cache_tx_buf_num = 4;    // Minimum safe value

    // 2. Cripple the AMPDU (Aggregation)
    // AMPDU is "High Speed Mode". We don't need 100mbps for audio.
    cfg.ampdu_rx_enable = 0;     // Disable completely if possible, or set extremely low
    cfg.ampdu_tx_enable = 0;     // Disable completely

    // 3. Force "nvs" off (Optional, saves a tiny bit of RAM/Flash ops)
    cfg.nvs_enable = 0;
    
    
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_start());
    
    esp_wifi_set_ps(WIFI_PS_NONE);

    wifi_initialized = true;
    printf("WiFi Stack Initialized.\n");
    checkAvailableMemory();
}

void trigger_wifi_scan(void) {
    if (!wifi_initialized) {
        printf("Error: WiFi not initialized! Call init_wifi_stack_once() first.\n");
        return;
    }
    
    // Reset to first page
    g_wifi_page_index = 0;
    
    printf("Starting WiFi Scan...\n");

    // 1. Start Scan (Blocking)
    // This blocks for ~1.5s. Ensure Watchdog doesn't bite if this task is high priority.
    esp_wifi_scan_start(NULL, true);

    // 2. Get number of results found
    uint16_t ap_count = 0;
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_num(&ap_count));
    
    // Safety limit
    if (ap_count > MAX_WIFI_RESULTS) ap_count = MAX_WIFI_RESULTS;

    // 3. FIX: Allocate buffer on HEAP, not Stack
    wifi_ap_record_t *ap_info = (wifi_ap_record_t *)calloc(ap_count, sizeof(wifi_ap_record_t));
    
    if (!ap_info) {
        printf("CRITICAL: Out of memory for WiFi scan!\n");
        return;
    }

    // 4. Get Records into Heap Buffer
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_records(&ap_count, ap_info));

    // 5. Update Global Data
    g_wifi_scan_count = ap_count;
    
    for (int i = 0; i < ap_count; i++) {
        // Safe Copy
        strncpy(g_wifi_scan_results[i].ssid, (char *)ap_info[i].ssid, 32);
        g_wifi_scan_results[i].ssid[32] = '\0';
        
        g_wifi_scan_results[i].rssi = ap_info[i].rssi;
        g_wifi_scan_results[i].channel = ap_info[i].primary;
        g_wifi_scan_results[i].auth_mode = ap_info[i].authmode;
        
        // Debug
        // printf("[%d] %s (%d)\n", i, g_wifi_scan_results[i].ssid, g_wifi_scan_results[i].rssi);
    }
    
    // 6. Free the Heap Buffer
    free(ap_info);
    
    printf("Scan Done. Found %d networks.\n", g_wifi_scan_count);
    
    // 7. Refresh UI
    refresh_wifi_list_ui();
    update_full_ui();
}


// Context struct to pass data into the decoder callback
typedef struct {
    ImageTexture *texture; // Your texture struct
    int outputX;           // Where to draw it on the texture
    int outputY;
} JpegDev;

static UINT tjd_input(JDEC* jd, BYTE* buff, UINT nd) {
    FILE *f = (FILE *)jd->device;
    if (buff) {
        size_t read = fread(buff, 1, nd, f);
        // If we hit EOF, log it but return what we got
        if (read < nd && feof(f)) {
            // ESP_LOGW("MJPEG", "Input: EOF hit unexpectedly"); // Comment out if spammy
        }
        return (UINT)read;
    } else {
        if (fseek(f, nd, SEEK_CUR) == 0) return nd;
        return 0;
    }
}

