playrinc/FreeOS/main/ESP32Support.c
// 2. OUTPUT FUNC: Receives decoded RGB888 blocks and converts to RGBA
static UINT tjd_output(JDEC* jd, void* bitmap, JRECT* rect) {
    JpegDev *dev = (JpegDev *)jd->device;
    ImageTexture *tex = dev->texture;

    // 'bitmap' is an array of RGB bytes (R, G, B, R, G, B...)
    uint8_t *rgb = (uint8_t *)bitmap;
    
    // Loop through the rectangular block provided by the decoder
    for (int y = rect->top; y <= rect->bottom; y++) {
        for (int x = rect->left; x <= rect->right; x++) {
            
            // Safety check: Don't write outside your texture memory
            if (x < tex->width && y < tex->height) {
                
                // Calculate target index in your RGBA array
                int index = y * tex->width + x;
                
                // Convert RGB (3 bytes) to RGBA (4 bytes)
                tex->data[index].r = rgb[0];
                tex->data[index].g = rgb[1];
                tex->data[index].b = rgb[2];
                tex->data[index].a = 255; // Fully opaque
            }
            // Move source pointer forward 3 bytes (R,G,B)
            rgb += 3;
        }
    }
    return 1; // Continue decoding
}

#define READ_CHUNK_SIZE 4096

// Update to match your screen resolution
#define VID_W 480
#define VID_H 320

void video_player_task(void *pvParam) {
    // 1. Correct Path
    const char *filename = "/sdcard/output.mjpeg";
    FILE *f = fopen(filename, "rb");
    
    if (!f) {
        FreeOSLogE(TAG, "Failed to open %s", filename);
        vTaskDelete(NULL);
    }

    // 2. Get File Size for EOF checks
    fseek(f, 0, SEEK_END);
    long fileSize = ftell(f);
    fseek(f, 0, SEEK_SET);
    FreeOSLogI(TAG, "File Size: %ld", fileSize);

    // 3. Allocate 480x320 Buffers
    ImageTexture *frameBuffer = heap_caps_malloc(sizeof(ImageTexture), MALLOC_CAP_SPIRAM);
    frameBuffer->width = VID_W;
    frameBuffer->height = VID_H;
    
    // 480x320x4 bytes = ~600KB. Ensure your ESP32 has PSRAM enabled.
    frameBuffer->data = heap_caps_malloc(VID_W * VID_H * sizeof(ColorRGBA), MALLOC_CAP_SPIRAM);
    
    if (!frameBuffer->data) {
        FreeOSLogE(TAG, "Failed to allocate video memory! Check PSRAM.");
        fclose(f);
        vTaskDelete(NULL);
    }

    char *work = heap_caps_malloc(4096, MALLOC_CAP_INTERNAL);
    uint8_t *chunkBuf = heap_caps_malloc(READ_CHUNK_SIZE, MALLOC_CAP_INTERNAL);

    JDEC jdec;
    JpegDev dev;
    dev.texture = frameBuffer;

    FreeOSLogI(TAG, "Starting 480x320 Video...");

    while (1) {
        bool foundFrame = false;
        long frameStartOffset = 0;
        
        // --- SCANNING ---
        while (!foundFrame) {
            long currentPos = ftell(f);
            size_t bytesRead = fread(chunkBuf, 1, READ_CHUNK_SIZE, f);
            
            // EOF Check
            if (bytesRead < 2) {
                clearerr(f); fseek(f, 0, SEEK_SET); continue;
            }

            for (int i = 0; i < bytesRead - 1; i++) {
                if (chunkBuf[i] == 0xFF && chunkBuf[i+1] == 0xD8) {
                    foundFrame = true;
                    frameStartOffset = currentPos + i;
                    break;
                }
            }
            if (!foundFrame) vTaskDelay(1);
        }

        // --- DECODE ---
        
        // Safety: If we found a frame very close to the end (e.g. last 1KB), it's likely truncated.
        if (fileSize - frameStartOffset < 1024) {
            ESP_LOGW(TAG, "Skipping truncated frame at end of file.");
            clearerr(f);
            fseek(f, 0, SEEK_SET);
            continue;
        }

        clearerr(f);
        fseek(f, frameStartOffset, SEEK_SET);

        JRESULT res = jd_prepare(&jdec, tjd_input, work, 4096, f);
        
        if (res == JDR_OK) {
            jdec.device = &dev;
            res = jd_decomp(&jdec, tjd_output, 0);
            
            if (res == JDR_OK) {
                // SUCCESS
                //FreeOSLogI("GFX", "Sent Pixel Buffer Command");
                GraphicsCommand cmd = {
                    .cmd = CMD_DRAW_PIXEL_BUFFER,
                    .x = 0, .y = 0,
                    .w = VID_W, .h = VID_H, // 480x320
                    .pixelBuffer = frameBuffer->data
                };
                QueueSend(g_graphics_queue, &cmd, QUEUE_MAX_DELAY);
                
                GraphicsCommand cmd_flush = {
                    .cmd = CMD_UPDATE_AREA,
                    .x = 0, .y = 0, .w = VID_W, .h = VID_H
                };
                QueueSend(g_graphics_queue, &cmd_flush, QUEUE_MAX_DELAY);
            }
            else {
                //FreeOSLogI("GFX", "Decode Failed");
                // Decode Failed (Likely EOF hit unexpectedly)
                // If we fail, assume this frame is bad/truncated.
                // If we are near the end of the file (>90%), just restart.
                if (frameStartOffset > fileSize * 0.9) {
                     ESP_LOGW(TAG, "EOF hit near end. Restarting video.");
                     fseek(f, 0, SEEK_SET);
                     continue;
                }
            }
        }
        else {
             // Prepare failed.
             if (frameStartOffset > fileSize * 0.9) {
                 fseek(f, 0, SEEK_SET);
                 continue;
            }
        }

        // Advance Ptr
        clearerr(f);
        fseek(f, frameStartOffset + 2, SEEK_SET);

        // Frame Pacing (480x320 takes longer to transfer, so 30ms might be optimistic)
        // If it feels slow, decrease this to 10 or 0.
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}



typedef struct {
    FILE* f;
    CCImage* img;
} ThumbContext;

static UINT tjd_input_thumb(JDEC* jd, BYTE* buff, UINT nd) {
    ThumbContext *ctx = (ThumbContext *)jd->device;
    if (buff) return (UINT)fread(buff, 1, nd, ctx->f);
    return fseek(ctx->f, nd, SEEK_CUR) == 0 ? nd : 0;
}

static UINT tjd_output_thumb(JDEC* jd, void* bitmap, JRECT* rect) {
    ThumbContext *ctx = (ThumbContext *)jd->device;
    CCImage *img = ctx->img; // Get the image from context
    uint8_t *rgb = (uint8_t *)bitmap;

    for (int y = rect->top; y <= rect->bottom; y++) {
        for (int x = rect->left; x <= rect->right; x++) {
            if (x < img->size->width && y < img->size->height) {
                int index = y * img->size->width + x;
                ColorRGBA *pixel = &((ColorRGBA*)img->imageData)[index];
                pixel->r = rgb[0];
                pixel->g = rgb[1];
                pixel->b = rgb[2];
                pixel->a = 255;
            }
            rgb += 3;
        }
    }
    return 1;
}

