playrinc/FreeOS/main/ESP32Support.c
static UINT tjd_input_one_frame(JDEC* jd, BYTE* buff, UINT nd) {
    FILE *f = (FILE *)jd->device;
    if (buff) return (UINT)fread(buff, 1, nd, f);
    return fseek(f, nd, SEEK_CUR) == 0 ? nd : 0;
}

// Output: Writes RGBA to CCImage buffer
static UINT tjd_output_one_frame(JDEC* jd, void* bitmap, JRECT* rect) {
    // We pass the CCImage* as the device context
    CCImage *img = (CCImage *)jd->device;
    uint8_t *rgb = (uint8_t *)bitmap;

    for (int y = rect->top; y <= rect->bottom; y++) {
        for (int x = rect->left; x <= rect->right; x++) {
            if (x < img->size->width && y < img->size->height) {
                int index = y * img->size->width + x;
                ColorRGBA *pixel = &((ColorRGBA*)img->imageData)[index];
                
                pixel->r = rgb[0];
                pixel->g = rgb[1];
                pixel->b = rgb[2];
                pixel->a = 255; // Opaque
            }
            rgb += 3;
        }
    }
    return 1;
}




// Corrected Main Function Call
CCImage* imageWithVideoFrame(const char *path, int width, int height) {
    FILE *f = fopen(path, "rb");
    if (!f) {
        FreeOSLogE("IMG", "Could not open video: %s", path);
        return NULL;
    }
    
    FreeOSLogI("IMG", "Could open video: %s", path);

    // 1. Allocate CCImage in PSRAM
    CCImage *img = image();
    img->size->width = width;
    img->size->height = height;
    img->imageData = heap_caps_malloc(width * height * sizeof(ColorRGBA), MALLOC_CAP_SPIRAM);
    
    // 2. Scan for First Frame (FF D8)
    // We scan the first 4KB. If the frame isn't there, it's not a valid MJPEG.
    uint8_t *chunk = cc_safe_alloc(1, 4096);
    size_t read = fread(chunk, 1, 4096, f);
    long headerOffset = -1;

    for (int i = 0; i < read - 1; i++) {
        if (chunk[i] == 0xFF && chunk[i+1] == 0xD8) {
            headerOffset = i;
            break;
        }
    }
    free(chunk);

    if (headerOffset == -1) {
        FreeOSLogE("IMG", "No frame found in video header");
        fclose(f);
        // Return a blank/error image or NULL
        return img;
    }

    // 3. Decode
    fseek(f, headerOffset, SEEK_SET); // Jump to the Start of Image
    
    char *work = cc_safe_alloc(1, 4096);
    JDEC jdec;


    // Context holds both the File and the Target Image
    ThumbContext ctx;
    ctx.f = f;
    ctx.img = img;

    // Use specific helpers for this context
    if (jd_prepare(&jdec, tjd_input_thumb, work, 4096, &ctx) == JDR_OK) {
        jd_decomp(&jdec, tjd_output_thumb, 0);
    }
    
    // --- DEBUG: LOG PIXEL DATA (FIXED) ---
    FreeOSLogI("IMG", "--- PIXEL DATA DUMP ---");

    // 1. Cast the raw bytes to a Pixel Array
    ColorRGBA *pixels = (ColorRGBA *)img->imageData;
    
    // Print First 5 Pixels (Top Left)
    for (int i = 0; i < 5; i++) {
        ColorRGBA p = pixels[i]; // Now this works
        FreeOSLogI("IMG", "Pixel[%d]: R=%d G=%d B=%d A=%d", i, p.r, p.g, p.b, p.a);
    }

    // Print Center Pixel
    int centerIdx = (height/2) * width + (width/2);
    ColorRGBA p = pixels[centerIdx];
    FreeOSLogI("IMG", "Pixel[Center]: R=%d G=%d B=%d A=%d", p.r, p.g, p.b, p.a);

    free(work);
    fclose(f);
    return img;
}

typedef struct {
    FILE *f;
    CCImageView *view;
    uint8_t *chunkBuf; // Buffer for scanning
    char *workBuf;     // Buffer for decoder
    CCImage *imgBuffer; // Reusable image memory
} VideoState;

void next_frame_task(void *pvParam) {
    int64_t t3 = esp_timer_get_time();
    
    CCImageView *targetView = (CCImageView *)pvParam;
    const char *path = "/sdcard/output.mjpeg";

    // 1. Setup State
    FILE *f = fopen(path, "rb");
    if (!f) {
        FreeOSLogE("VID", "Cannot open %s", path);
        vTaskDelete(NULL);
    }

    // Allocate reusable buffers (Don't malloc inside the loop!)
    uint8_t *chunkBuf = heap_caps_malloc(4096, MALLOC_CAP_INTERNAL);
    char *workBuf = heap_caps_malloc(4096, MALLOC_CAP_INTERNAL);
    
    // Create the image buffer ONCE. We will just overwrite its pixels.
    CCImage *img = image();
    img->size->width = 320;
    img->size->height = 480;
    img->imageData = heap_caps_malloc(480 * 320 * sizeof(ColorRGBA), MALLOC_CAP_SPIRAM);
    
    // Assign this image to the view immediately
    targetView->image = img;

    JDEC jdec;
    ThumbContext ctx; // Reuse our context helper from before
    ctx.f = f;
    ctx.img = img;

    FreeOSLogI("VID", "Starting Animation Loop...");

    while (1) {
        bool foundFrame = false;
        long frameStart = 0;

        // --- 2. Scan for Next Frame ---
        while (!foundFrame) {
            long pos = ftell(f);
            size_t read = fread(chunkBuf, 1, 4096, f);
            
            // Loop video at EOF
            if (read < 2) {
                clearerr(f); fseek(f, 0, SEEK_SET); continue;
            }

            for (int i = 0; i < read - 1; i++) {
                if (chunkBuf[i] == 0xFF && chunkBuf[i+1] == 0xD8) {
                    foundFrame = true;
                    frameStart = pos + i;
                    break;
                }
            }
        }

        // --- 3. Decode Frame ---
        clearerr(f);
        fseek(f, frameStart, SEEK_SET);

        if (jd_prepare(&jdec, tjd_input_thumb, workBuf, 4096, &ctx) == JDR_OK) {
            if (jd_decomp(&jdec, tjd_output_thumb, 0) == JDR_OK) {
                
                // --- 4. Trigger Redraw ---
                // We don't send pixel data here. We tell the Graphics Task
                // "The view has changed, please redraw the tree."
                
                // Note: The graphics task reads targetView->image->imageData,
                // which we just overwrote with new pixels.
                
                GraphicsCommand cmd = {
                    .cmd = CMD_DRAW_PIXEL_BUFFER, // Or your custom view redraw command
                    .x = 0, .y = 0, .w = 320, .h = 480,
                    .pixelBuffer = img->imageData
                };
                QueueSend(g_graphics_queue, &cmd, 0);
                
