playrinc/FreeOS/main/ESP32Support.c
                //update_view_only(targetView);
                
                GraphicsCommand cmd_flush = {
                    .cmd = CMD_UPDATE_AREA,
                    .x = 0, .y = 0, .w = 320, .h = 480
                };
                QueueSend(g_graphics_queue, &cmd_flush, QUEUE_MAX_DELAY);
                
                
            }
        }

        // --- 5. Advance & Wait ---
        clearerr(f);
        fseek(f, frameStart + 2, SEEK_SET);
        
        // 0.1s Delay (100ms)
        //vTaskDelay(pdMS_TO_TICKS(25));
        
        int64_t t4 = esp_timer_get_time();

        FreeOSLogI(TAG, "nxt frame Time:  %lld us", (t4 - t3));
    }
}

int currentFrame = 0;

void next_frame_task1(void *pvParam) {
    
    while (1) {
        
        CCImageView *targetView = (CCImageView *)pvParam;
        CCString* path = stringWithFormat("/sdcard/frames/img_%d.png", currentFrame);
        
        targetView->image = imageWithFile(path);
        
        /*GraphicsCommand cmd = {
            .cmd = CMD_DRAW_PIXEL_BUFFER, // Or your custom view redraw command
            .x = 0, .y = 0, .w = 320, .h = 480,
            .pixelBuffer = targetView->image->imageData
        };
        QueueSend(g_graphics_queue, &cmd, 0);*/
        
        //update_view_only(targetView);
        
        GraphicsCommand cmd_flush = {
            .cmd = CMD_UPDATE_AREA,
            .x = 0, .y = 0, .w = 320, .h = 480
        };
        QueueSend(g_graphics_queue, &cmd_flush, QUEUE_MAX_DELAY);
        
        currentFrame++;
        
        // 0.1s Delay (100ms)
        vTaskDelay(pdMS_TO_TICKS(50));
        
    }
    
}

CCImageView* videoView = NULL;

void setup_video_preview_ui(void) {
    // 1. Create the Image View
    videoView = imageViewWithFrame(ccRect(0, 0, 320, 480));
    
    // 2. Load JUST the first frame (480x320 resolution)
    // Note: This might take ~200-500ms, blocking the UI briefly.
    videoView->image = imageWithVideoFrame("/sdcard/output.mjpeg", 320, 480);
    
    FreeOSLogI("IMG", "imageWithVideoFrame");
    
    // 3. Add to screen
    viewAddSubview(mainWindowView, videoView);
    
    
}

void setup_video_preview_ui1(void) {
    // 1. Create the Image View
    videoView = imageViewWithFrame(ccRect(0, 0, 320, 480));
    
    // 2. Load JUST the first frame (480x320 resolution)
    // Note: This might take ~200-500ms, blocking the UI briefly.
    videoView->image = imageWithFile(ccs("/sdcard/frames/img_1.png"));
    
    FreeOSLogI("IMG", "imageWithVideoFrame");
    
    // 3. Add to screen
    viewAddSubview(mainWindowView, videoView);
    
    
}


// CONSTANTS FROM FFMPEG SETUP
#define VIDEO_WIDTH  320  // Transposed width
#define VIDEO_HEIGHT 480  // Transposed height

// ... (Keep your Framebuffer struct and yuv2rgb helpers here) ...

typedef struct {
    Framebuffer *fb;
    const char *filepath;
} VideoTaskParams;


void vVideoDecodeTask(void *pvParameters) {
    VideoTaskParams *params = (VideoTaskParams *)pvParameters;
    Framebuffer *fb = params->fb;
    const char *path = params->filepath;

    FreeOSLogI(TAG, "Opening video file: %s", path);
    FILE *f = fopen(path, "rb");
    if (f == NULL) {
        FreeOSLogE(TAG, "Failed to open file");
        vTaskDelete(NULL);
        return;
    }

    // 1. INITIAL SETUP
    esp_h264_dec_cfg_sw_t cfg = { .pic_type = ESP_H264_RAW_FMT_I420 };
    esp_h264_dec_handle_t dec_handle = NULL;
    esp_h264_dec_sw_new(&cfg, &dec_handle);
    esp_h264_dec_open(dec_handle);

    // 2. ALLOCATE BUFFER
    const int BUFFER_CAPACITY = 1024 * 512;
        
        // Verify we have enough PSRAM
        uint8_t *file_buffer = (uint8_t *)heap_caps_malloc(BUFFER_CAPACITY, MALLOC_CAP_SPIRAM);
        
        if (file_buffer == NULL) {
            FreeOSLogE(TAG, "Failed to allocate 512KB buffer! Trying 256KB...");
            // Fallback if your specific board is low on RAM
            file_buffer = (uint8_t *)heap_caps_malloc(1024 * 256, MALLOC_CAP_SPIRAM);
        }
    
    size_t current_data_len = 0;
    esp_h264_dec_in_frame_t in_frame = { 0 };
    esp_h264_dec_out_frame_t out_frame = { 0 };

    FreeOSLogI(TAG, "Starting decode loop...");

    while (1) {
        // A. READ DATA
        size_t space_available = BUFFER_CAPACITY - current_data_len;
        if (space_available < 1024) {
            current_data_len = 0;
            space_available = BUFFER_CAPACITY;
        }

        size_t bytes_read = fread(file_buffer + current_data_len, 1, space_available, f);
        if (bytes_read == 0) {
            fseek(f, 0, SEEK_SET);
            current_data_len = 0;
            vTaskDelay(pdMS_TO_TICKS(10));
            continue;
        }
        current_data_len += bytes_read;

        // B. DECODE LOOP
        in_frame.raw_data.buffer = file_buffer;
        in_frame.raw_data.len = current_data_len;
        in_frame.dts = 0;
        in_frame.pts = 0;

        while (in_frame.raw_data.len > 0) {
            
            esp_h264_err_t ret = esp_h264_dec_process(dec_handle, &in_frame, &out_frame);

            // --- CASE 1: SUCCESS ---
            if (ret == ESP_H264_ERR_OK) {
                if (out_frame.outbuf != NULL) {
                     // Draw Frame (Optimized YUV->RGB)
                    int width = VIDEO_WIDTH;
                    int height = VIDEO_HEIGHT;
                    uint8_t *y_plane = out_frame.outbuf;
                    uint8_t *u_plane = y_plane + (width * height);
                    uint8_t *v_plane = u_plane + (width * height / 4);
                    int u_stride = width / 2;

                    for (int y = 0; y < height; y += 2) {
                        for (int x = 0; x < width; x += 2) {
                            if (y >= fb->displayHeight || x >= fb->displayWidth) continue;
                            
                            int uv_off = (y>>1)*u_stride + (x>>1);
                            int d = u_plane[uv_off] - 128;
                            int e = v_plane[uv_off] - 128;
                            int rc = (409*e+128);
                            int gc = (-100*d-208*e+128);
                            int bc = (516*d+128);

                            int y_idx[4] = { y*width+x, y*width+x+1, (y+1)*width+x, (y+1)*width+x+1 };
                            int fb_idx[4] = {
                                (y*fb->displayWidth+x)*3, (y*fb->displayWidth+x+1)*3,
                                ((y+1)*fb->displayWidth+x)*3, ((y+1)*fb->displayWidth+x+1)*3
                            };

                            for(int k=0; k<4; k++) {
                                int py = y+(k/2), px = x+(k%2);
                                if(py>=fb->displayHeight || px>=fb->displayWidth) continue;
                                int y_term = 298*(y_plane[y_idx[k]]-16);
                                uint8_t *p = (uint8_t*)fb->pixelData + fb_idx[k];
                                int r = (y_term+rc)>>8; p[0] = (r>255)?255:(r<0?0:r);
                                int g = (y_term+gc)>>8; p[1] = (g>255)?255:(g<0?0:g);
                                int b = (y_term+bc)>>8; p[2] = (b>255)?255:(b<0?0:b);
                            }
                        }
                    }
                }
                
                if (in_frame.consume > 0) {
                    in_frame.raw_data.buffer += in_frame.consume;
                    in_frame.raw_data.len    -= in_frame.consume;
                } else {
                    break; // Need more data
                }
            }
            
            // --- CASE 2: FATAL ERROR (RESTART VIDEO) ---
            else {
                FreeOSLogE(TAG, "Decoder Error %d. RESTARTING VIDEO to restore sync...", ret);
                
