playrinc/FreeOS/main/ESP32Support.c
                // 1. Destroy Corrupted Decoder
                esp_h264_dec_close(dec_handle);
                esp_h264_dec_del(dec_handle);
                
                // 2. REWIND FILE (The Fix)
                // We must go back to start to read SPS/PPS headers again
                fseek(f, 0, SEEK_SET);
                
                // 3. Clear Buffer
                current_data_len = 0;
                in_frame.raw_data.len = 0; // Forces break from inner loop

                // 4. Create Fresh Decoder
                dec_handle = NULL;
                esp_h264_dec_sw_new(&cfg, &dec_handle);
                esp_h264_dec_open(dec_handle);
                
                ESP_LOGW(TAG, "Video Restarted.");
                break; // Break inner loop to trigger fread from byte 0
            }
        }

        // C. PRESERVE LEFTOVERS
        size_t leftovers = in_frame.raw_data.len;
        if (leftovers > 0) {
            memmove(file_buffer, in_frame.raw_data.buffer, leftovers);
        }
        current_data_len = leftovers;

        vTaskDelay(pdMS_TO_TICKS(10));
    }

    esp_h264_dec_close(dec_handle);
    esp_h264_dec_del(dec_handle);
    free(file_buffer);
    fclose(f);
    vTaskDelete(NULL);
}

void start_video_player(Framebuffer *fb) {
    // You must allocate this structure so it persists after this function returns
    VideoTaskParams *params = cc_safe_alloc(1, sizeof(VideoTaskParams));
    params->fb = fb;
    // Assuming you have mounted SD card to /sdcard
    params->filepath = "/sdcard/output.h264";

    xTaskCreatePinnedToCore(vVideoDecodeTask, "VidTask", 16384, (void*)params, 2, NULL, 1);
}

// --- HELPER: YUV420 to RGB888 ---
// Returns a new buffer that you must free() later
uint8_t* yuv420_to_rgb888(uint8_t *y_plane, uint8_t *u_plane, uint8_t *v_plane, int width, int height) {
    // Allocate RGB Buffer (Width * Height * 3 bytes)
    uint8_t *rgb_buffer = (uint8_t *)heap_caps_malloc(width * height * 3, MALLOC_CAP_SPIRAM);
    if (!rgb_buffer) return NULL;

    int u_stride = width / 2;

    for (int y = 0; y < height; y++) {
        for (int x = 0; x < width; x++) {
            // Get Y (Luma)
            int Y_val = y_plane[y * width + x];
            
            // Get UV (Chroma) - Shared by 2x2 pixels
            int uv_idx = (y >> 1) * u_stride + (x >> 1);
            int U_val = u_plane[uv_idx];
            int V_val = v_plane[uv_idx];

            // Math
            int c = Y_val - 16;
            int d = U_val - 128;
            int e = V_val - 128;

            int r = (298 * c + 409 * e + 128) >> 8;
            int g = (298 * c - 100 * d - 208 * e + 128) >> 8;
            int b = (298 * c + 516 * d + 128) >> 8;

            // Clamp
            if (r > 255) r = 255; else if (r < 0) r = 0;
            if (g > 255) g = 255; else if (g < 0) g = 0;
            if (b > 255) b = 255; else if (b < 0) b = 0;

            // Write to buffer
            int idx = (y * width + x) * 3;
            rgb_buffer[idx] = (uint8_t)r;
            rgb_buffer[idx+1] = (uint8_t)g;
            rgb_buffer[idx+2] = (uint8_t)b;
        }
    }
    return rgb_buffer;
}

// --- MAIN FUNCTION: GET FIRST FRAME ---
// Returns: A pointer to RGB888 data (in PSRAM). Returns NULL on failure.
// Note: You must free() the result when done!
uint8_t* get_first_video_frame(const char *filepath, int width, int height) {
    FreeOSLogI("VID", "Extracting first frame from %s...", filepath);

    FILE *f = fopen(filepath, "rb");
    if (f == NULL) {
        FreeOSLogE("VID", "File not found");
        return NULL;
    }

    // 1. Setup Decoder
    esp_h264_dec_cfg_sw_t cfg = { .pic_type = ESP_H264_RAW_FMT_I420 };
    esp_h264_dec_handle_t dec_handle = NULL;
    if (esp_h264_dec_sw_new(&cfg, &dec_handle) != ESP_H264_ERR_OK) {
        fclose(f);
        return NULL;
    }
    esp_h264_dec_open(dec_handle);

    // 2. Allocate Temp Buffer (Large enough for one I-Frame)
    const int CHUNK_SIZE = 1024 * 64;
    uint8_t *file_buffer = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_SPIRAM);
    
    uint8_t *result_pixels = NULL;
    int decoded = 0;
    
    esp_h264_dec_in_frame_t in_frame = { 0 };
    esp_h264_dec_out_frame_t out_frame = { 0 };

    // 3. Read Loop (Only runs until first frame is found)
    while (!decoded) {
        size_t bytes_read = fread(file_buffer, 1, CHUNK_SIZE, f);
        if (bytes_read == 0) break; // EOF

        in_frame.raw_data.buffer = file_buffer;
        in_frame.raw_data.len = bytes_read;
        
        while (in_frame.raw_data.len > 0) {
            esp_h264_err_t ret = esp_h264_dec_process(dec_handle, &in_frame, &out_frame);
            
            if (ret == ESP_H264_ERR_OK && out_frame.outbuf != NULL) {
                FreeOSLogI("VID", "Frame found! Converting...");
                
                // Pointers for YUV420 Planar
                uint8_t *y = out_frame.outbuf;
                uint8_t *u = y + (width * height);
                uint8_t *v = u + (width * height / 4);

                // Convert to RGB
                result_pixels = yuv420_to_rgb888(y, u, v, width, height);
                
                decoded = 1; // STOP LOOP
                break;
            }

            if (in_frame.consume > 0) {
                in_frame.raw_data.buffer += in_frame.consume;
                in_frame.raw_data.len -= in_frame.consume;
            } else {
                break; // Fetch more data
            }
        }
    }

    // 4. Cleanup
    free(file_buffer);
    esp_h264_dec_close(dec_handle);
    esp_h264_dec_del(dec_handle);
    fclose(f);

    if (result_pixels) {
        FreeOSLogI("VID", "Success. Frame extraction complete.");
    } else {
        FreeOSLogE("VID", "Failed to decode any frame.");
    }

    return result_pixels;
}

// --- MAIN FUNCTION: GET SPECIFIC FRAME ---
// frameNumber: 0-based index (0 = first frame, 100 = 101st frame)
uint8_t* get_video_frame(const char *filepath, int width, int height, int frameNumber) {
    FreeOSLogI("VID", "Seeking Frame %d in %s...", frameNumber, filepath);

    FILE *f = fopen(filepath, "rb");
    if (f == NULL) {
        FreeOSLogE("VID", "File not found");
        return NULL;
    }

    // 1. Setup Decoder
    esp_h264_dec_cfg_sw_t cfg = { .pic_type = ESP_H264_RAW_FMT_I420 };
    esp_h264_dec_handle_t dec_handle = NULL;
    if (esp_h264_dec_sw_new(&cfg, &dec_handle) != ESP_H264_ERR_OK) {
        fclose(f);
        return NULL;
    }
    esp_h264_dec_open(dec_handle);

    // 2. Allocate Buffer (64KB is usually enough for chunks)
    const int BUFFER_CAPACITY = 1024 * 64;
    uint8_t *file_buffer = (uint8_t *)heap_caps_malloc(BUFFER_CAPACITY, MALLOC_CAP_SPIRAM);
    
