playrinc/FreeOS/main/ESP32Support.c
    uint8_t *result_pixels = NULL;
    int current_frame_index = 0;
    size_t current_data_len = 0;
    
    esp_h264_dec_in_frame_t in_frame = { 0 };
    esp_h264_dec_out_frame_t out_frame = { 0 };

    // 3. Decode Loop
    while (1) {
        // Read data into whatever space is left in buffer
        size_t space_available = BUFFER_CAPACITY - current_data_len;
        
        // Safety: If buffer full, hard reset logic (similar to your player task)
        if (space_available < 1024) {
             current_data_len = 0;
             space_available = BUFFER_CAPACITY;
        }

        size_t bytes_read = fread(file_buffer + current_data_len, 1, space_available, f);
        if (bytes_read == 0) break; // End of file

        current_data_len += bytes_read;
        in_frame.raw_data.buffer = file_buffer;
        in_frame.raw_data.len = current_data_len;
        
        while (in_frame.raw_data.len > 0) {
            esp_h264_err_t ret = esp_h264_dec_process(dec_handle, &in_frame, &out_frame);
            
            // Check if a frame was completed
            if (ret == ESP_H264_ERR_OK && out_frame.outbuf != NULL) {
                
                // Is this the frame we want?
                if (current_frame_index == frameNumber) {
                    FreeOSLogI("VID", "Found Frame %d! Converting...", frameNumber);
                    
                    uint8_t *y = out_frame.outbuf;
                    uint8_t *u = y + (width * height);
                    uint8_t *v = u + (width * height / 4);

                    // Convert ONLY this frame
                    result_pixels = yuv420_to_rgb888(y, u, v, width, height);
                    
                    // Cleanup and Exit immediately
                    goto cleanup;
                }
                
                // Not the right frame yet, keep going
                current_frame_index++;
            }

            // Advance pointers
            if (in_frame.consume > 0) {
                in_frame.raw_data.buffer += in_frame.consume;
                in_frame.raw_data.len -= in_frame.consume;
            } else {
                break; // Fetch more data
            }
        }

        // Preserve leftovers (Move to front)
        if (in_frame.raw_data.len > 0) {
            memmove(file_buffer, in_frame.raw_data.buffer, in_frame.raw_data.len);
        }
        current_data_len = in_frame.raw_data.len;
    }

cleanup:
    free(file_buffer);
    esp_h264_dec_close(dec_handle);
    esp_h264_dec_del(dec_handle);
    fclose(f);

    if (result_pixels) {
        FreeOSLogI("VID", "Frame extraction success.");
    } else {
        FreeOSLogE("VID", "Frame %d not found (Video too short?).", frameNumber);
    }

    return result_pixels;
}

void load_video_poster() {
    int w = 320;
    int h = 480;

    // 1. Get the pixels (Allocates memory in PSRAM)
    uint8_t *pixels = get_first_video_frame("/sdcard/output.h264", w, h);
    //uint8_t *pixels = get_video_frame("/sdcard/output.h264", w, h, 200);

    if (pixels != NULL) {
        // 2. Assign to your Framebuffer
        // Note: You might need to cast to (void*) depending on your struct definition
        fb = (Framebuffer){
            .displayWidth = w,
            .displayHeight = h,
            .pixelData = pixels, // The buffer we just created
            .colorMode = COLOR_MODE_BGR888
        };
        
        // 3. Draw it!
        GraphicsCommand cmd_flush = {
            .cmd = CMD_UPDATE_AREA,
            .x = 0, .y = 0,
            .w = 320, .h = 480
        };
        QueueSend(g_graphics_queue, &cmd_flush, QUEUE_MAX_DELAY);
        
        printf("load_video_poster...\n");
    }
}

bool keyboardTouchEnabled = true;
bool appTouchEnabled = true;

static int64_t last_draw_time = 0;
const int64_t draw_interval_us = 100000; // 0.1 seconds in microseconds scrolls smoothly
//const int64_t draw_interval_us = 050000; // 0.05 seconds in microseconds has lag from sending too many requests to graphics pipeline

void updateTouch(void *pvParameter) {
    uint32_t event;
    FT6336U_TouchPointType touch_data;
    float newOffY;
    
    // This tracks the *actual* hardware state
    bool is_currently_pressed = false;
    
    while (1) {
        // Wait for an interrupt OR a 50ms timeout
        xQueueReceive(touch_intr_queue, &event, pdMS_TO_TICKS(50));
        
        esp_err_t ret = ft6336u_scan(&touch_dev, &touch_data);
        if (ret != ESP_OK) {
            touch_data.touch_count = 0; // Treat scan error as a release
        }
        
        // --- ADD THIS LINE ---
        uint16_t current_y = touch_data.touch_count > 0 ? touch_data.tp[0].y : 0;
        
        // --- New State Logic ---
        if (touch_data.touch_count > 0) {
            // --- Finger is DOWN ---
            if (is_currently_pressed == false) {
                // This is a NEW press.
                is_currently_pressed = true; // 1. Set our local state
                g_drag_start_y = current_y; // Anchor the start point
                
                FreeOSLogI(TAG, "Touch Pressed: X=%u, Y=%u", touch_data.tp[0].x, touch_data.tp[0].y);
                
                // 2. Lock and post the "event" for LVGL to consume
                xSemaphoreTake(g_touch_mutex, QUEUE_MAX_DELAY);
                g_last_x = touch_data.tp[0].x;
                g_last_y = touch_data.tp[0].y;
                g_last_state = LV_INDEV_STATE_PR; // Set the "event"
                xSemaphoreGive(g_touch_mutex);
                
                int text_w = 200;
                int text_h = 30;
                
                ColorRGBA blue = {.r = 0, .g = 0, .b = 50, .a = 255};
                
                FreeOSLogI(TAG, "Graphics Command");
                
                int x1 = randNumberTo(320);
                int y1 = randNumberTo(480);
                
                x1 = 100;
                y1 = 410;
                
                FreeOSLogI(TAG, "Graphics Command %d %d", x1, y1);
                
                if (hasDrawnKeyboard == false) {
                    hasDrawnKeyboard = true;
                    
                    // --- 1. Send command to clear the area ---
                    GraphicsCommand cmd_clear;
                    cmd_clear.cmd = CMD_DRAW_RECT;
                    cmd_clear.x = x1;
                    cmd_clear.y = y1;
                    cmd_clear.w = text_w;
                    cmd_clear.h = text_h;
                    cmd_clear.color = blue;
                    //QueueSend(g_graphics_queue, &cmd_clear, 0);
                    
