playrinc/FreeOS/main/ESP32Support.c
                    ColorRGBA white2 = {.r = 255, .g = 255, .b = 255, .a = 255};
                    
                    // --- 2. Send command to draw the text ---
                    GraphicsCommand cmd_text;
                    cmd_text.cmd = CMD_DRAW_TEXT;
                    cmd_text.x = x1;
                    cmd_text.y = y1; // Your renderText needs to handle Y as baseline
                    cmd_text.text = strdup("Tapped!");
                    //QueueSend(g_graphics_queue, &cmd_text, 0);
                    
                    // --- 2. Send command to draw the text ---
                    GraphicsCommand cmd_text1;
                    cmd_text1.cmd = CMD_DRAW_TEXT;
                    cmd_text1.x = 20;
                    cmd_text1.y = 380; // Your renderText needs to handle Y as baseline
                    cmd_text1.text = strdup(" Q  W  E  R  T  Y  U  I  O  P");
                    cmd_text1.color = white2;
                    QueueSend(g_graphics_queue, &cmd_text1, 0);
                    
                    // --- 2. Send command to draw the text ---
                    GraphicsCommand cmd_text12;
                    cmd_text12.cmd = CMD_DRAW_TEXT;
                    cmd_text12.x = 20;
                    cmd_text12.y = 420; // Your renderText needs to handle Y as baseline
                    cmd_text12.text = strdup("   A  S  D  F  G  H  J  K  L");
                    cmd_text12.color = white2;
                    QueueSend(g_graphics_queue, &cmd_text12, 0);
                    
                    // --- 2. Send command to draw the text ---
                    GraphicsCommand cmd_text13;
                    cmd_text13.cmd = CMD_DRAW_TEXT;
                    cmd_text13.x = 20;
                    cmd_text13.y = 460; // Your renderText needs to handle Y as baseline
                    cmd_text13.text = strdup("     Z  X  C  V  B  N  M");
                    cmd_text13.color = white2;
                    QueueSend(g_graphics_queue, &cmd_text13, 0);
                    
                    const char *long_text = "The quick brown fox jumps over the lazy dog. "
                    "This text needs to demonstrate word-wrapping and line-breaking "
                    "within a confined area for our new scroll view. \n\n" // Explicit newline
                    "This final sentence should appear on a completely new line.";
                    
                    ColorRGBA text_color = {.r = 255, .g = 255, .b = 255, .a = 255}; // White
                    
                    // --- 3. Define and Initialize the TextFormat Struct ---
                    TextFormat text_format = {
                        // Property 1: Center the text horizontally within the clip_w area
                        .alignment = TEXT_ALIGN_CENTER,
                        
                        // Property 2: Never split words mid-line (will move "boundaries" to next line)
                        .wrapMode = TEXT_WRAP_MODE_WHOLE_WORD,
                        
                        // Property 3: Add 10 extra pixels of space between the calculated line height
                        .lineSpacing = -2,
                        
                        // Property 4: Use FreeType's kerning metrics for a polished look
                        .glyphSpacing = -1
                        
                        
                    };
                    
                    ColorRGBA black_alpha = {.r = 0, .g = 0, .b = 0, .a = 255};
                    GraphicsCommand cmd_text2;
                    cmd_text2.cmd = CMD_DRAW_TEXT_BOX;
                    cmd_text2.x = 20;
                    cmd_text2.y = 150; // Your renderText needs to handle Y as baseline
                    cmd_text2.w = 280;
                    cmd_text2.h = 300;
                    cmd_text2.color = text_color;
                    cmd_text2.textFormat = text_format;
                    cmd_text2.fontSize = 12;
                    cmd_text2.text = strdup(long_text);
                    QueueSend(g_graphics_queue, &cmd_text2, 0);
                    
                    GraphicsCommand cmd_star;
                    cmd_star.cmd = CMD_DRAW_STAR;
                    cmd_star.x = 20;
                    cmd_star.y = 460; // Your renderText needs to handle Y as baseline
                    //QueueSend(g_graphics_queue, &cmd_star, 0);
                    
                    GraphicsCommand cmd_update;
                    cmd_update.cmd = CMD_UPDATE_AREA;
                    cmd_update.x = 0;
                    cmd_update.y = 0; // A rough bounding box
                    cmd_update.w = 320;
                    cmd_update.h = 480; // A bit larger to be safe
                    QueueSend(g_graphics_queue, &cmd_update, 0);
                    
                    if (!addedCursor) {
                        addedCursor = true;
                        if (setup_cursor_buffers() != ESP_OK) {
                            FreeOSLogE(TAG, "FATAL: Failed to set up cursor backup buffers. Halting task.");
                            vTaskDelete(NULL);
                            return;
                        }
                        FreeOSLogI(TAG, "Cursor backup buffer allocated.");
                        
                        // 2. Build the CMD_CURSOR_SETUP command
                        GraphicsCommand cmd_cursor_setup;
                        cmd_cursor_setup.cmd = CMD_CURSOR_SETUP;
                        
                        // Set the exact location here:
                        cmd_cursor_setup.x = 100;
                        cmd_cursor_setup.y = 100;
                        
                        // Pass the cursor's fixed size in case the graphics task needs it
                        cmd_cursor_setup.w = CURSOR_W;
                        cmd_cursor_setup.h = CURSOR_H;
                        
                        // 3. Send the command to initiate the blink cycle
                        //QueueSend(g_graphics_queue, &cmd_cursor_setup, 0);
                    }
                    
