playrinc/FreeOS/main/ESP32Support.c
                }
                else {
                    ColorRGBA black_alpha = {.r = 0, .g = 0, .b = 0, .a = 255};
                    GraphicsCommand cmd_text;
                    cmd_text.cmd = CMD_DRAW_TEXT;
                    cmd_text.x = 30+keyboardCursorPosition*20;
                    cmd_text.y = 53; // Your renderText needs to handle Y as baseline
                    cmd_text.color = black_alpha;
                    cmd_text.text = strdup(letterForCoordinate());
                    
                    keyboardCursorPosition++;
                    
                    GraphicsCommand cmd_update;
                    cmd_update.cmd = CMD_UPDATE_AREA;
                    cmd_update.x = 0;
                    cmd_update.y = 0; // A rough bounding box
                    cmd_update.w = 320;
                    cmd_update.h = 100; // A bit larger to be safe
                    //QueueSend(g_graphics_queue, &cmd_update, 0);
                    
                    if (!setupui) {
                        
                        // 1. Create the high-level View Objects (RAM only)
                        // Make sure setup_ui_demo assigns to the global 'mainWindowView'
                        setup_ui_demo();
                        
                        // 2. Trigger the first render (Generates commands)
                        //update_full_ui();
                        
                        setupui = true;
                    }
                    
                    
                    
                    FreeOSLogI(TAG, "app_main() finished. Tasks are running.");
                }
                
            }
            else {
                FreeOSLogI(TAG, "touch 3");
                int curr_y = touch_data.tp[0].y;
                if (myDemoTextView != NULL) {
                    g_active_scrollview = myDemoTextView->scrollView;
                    
                    if (notFirstTouch == false) {
                        notFirstTouch = true;
                        g_touch_last_y = curr_y;
                        lastOffY = g_active_scrollview->contentOffset->y;
                        FreeOSLogI(TAG, "set lastOffY %d", lastOffY);
                    }
                    
                    if (g_active_scrollview) {
                        
                        int delta = g_touch_last_y - curr_y; // Drag Up = Positive Delta
                        FreeOSLogI(TAG, "g_active_scrollview %d", delta);
                        
                        // Calculate new offset
                        newOffY = lastOffY + (float)delta;
                        
                        float yValue = (float)lastOffY;
                        
                        CCPoint offsetPt;
                        offsetPt.x = 0;
                        offsetPt.y = (float)lastOffY;
                        
                        lastOffY = delta;
                        
                        CCPoint targetPoint = {
                            .x = 0,
                            .y = lastOffY // Correctly assigns the float value
                        };
                        
                        // Apply offset (This function handles clamping and moving the view)
                        //CCPoint offsetPt = {.x = 0, .y = yValue};
                        FreeOSLogI(TAG, "g_active_scrollview1 %f %f %f", lastOffY, newOffY, yValue);
                        scrollViewSetContentOffset(g_active_scrollview, &targetPoint);//ccPoint(0, lastOffY)
                        FreeOSLogI(TAG, "g_active_scrollview contentOffset %f", g_active_scrollview->contentOffset->y);
                        
                        // 2. THROTTLING CHECK: Only draw if 0.2s has passed
                        int64_t now = esp_timer_get_time();
                        
                        if ((now - last_draw_time) > draw_interval_us) {
                            
                            // Send the expensive command
                            update_view_only(g_active_scrollview->view);
                            
                            FreeOSLogI(TAG, "g_active_scrollview contentOffset %f", g_active_scrollview->contentOffset->y);
                            
                            // Reset the timer
                            last_draw_time = now;
                        }
                        
                    }
                }
                
                
                
            }
            // If finger is still down, we do nothing.
            
        } else {
            
            // --- Finger is UP ---
            if (is_currently_pressed == true) {
                // This is a NEW release.
                is_currently_pressed = false; // 1. Set our local state
                notFirstTouch = false;
                if (g_active_scrollview) FreeOSLogI(TAG, "Touch Released");
            }
        }
        
        
        if (touchEnabled) {
            if (touch_data.touch_count > 0 && setupui == true) {
                int touchX = touch_data.tp[0].x;
                int touchY = touch_data.tp[0].y;
                
                is_currently_pressed = true; // 1. Set our local state
                FreeOSLogI(TAG, "Touch DOWN");
                
                // If keyboard is visible (check if uiKeyboardView != NULL)
                if (uiKeyboardView != NULL && keyboardTouchEnabled == true) {
                    if (touchY > uiKeyboardView->frame->origin->y) {
                        keyboardTouchEnabled = false;
                        handle_keyboard_touch(touchX, touchY);
                        printf("handle handle_keyboard_touch");
                        //return; // Swallow touch so nothing underneath gets clicked
                    }
                    
                }
            }
            else {
                keyboardTouchEnabled = true;
            }
            
            if (touch_data.touch_count == 0) {
                is_currently_pressed = false;
                //FreeOSLogI(TAG, "Touch UP");
                
                if (currentView == CurrentViewFiles) {
                    handle_files_touch(0, 0, is_currently_pressed);
                }
                if (currentView == CurrentViewClock) {
                    printf("CurrentViewClock");
                    handle_clock_touch(0, 0, is_currently_pressed);
                }
                if (currentView == CurrentViewPaint) {
                    handle_paint_touch(0, 0, is_currently_pressed);
                }
                if (currentView == CurrentViewMusic) {
                    handle_music_touch(0, 0, is_currently_pressed);
                }
                
