playrinc/FreeOS/main/ESP32Support.c
            }
            
            //printf("touch3");
            
            if (currentView == CurrentViewHome) {
                
                if (touch_data.touch_count > 0 && setupui == true) {
                    int curr_x = touch_data.tp[0].x;
                    int curr_y = touch_data.tp[0].y;
                    
                    checkAvailableMemory();
                    
                    CCView* touchedView = find_grid_item_at(curr_x, curr_y);
                    CCPoint parentAbs = getAbsoluteOrigin(touchedView);
                    
                    if (touchedView && touchedView != g_last_touched_icon && openedApp == false) {
                        if (g_last_touched_icon != NULL) {
                            if (g_last_touched_icon->backgroundColor) free(g_last_touched_icon->backgroundColor);
                            g_last_touched_icon->backgroundColor = color(0,0,0,0);
                            update_view_area_via_parent(g_last_touched_icon);
                        }
                        
                        if (touchedView->backgroundColor) free(touchedView->backgroundColor);
                        touchedView->backgroundColor = color(0.0, 0.0, 0.0, 0.2);
                        update_view_only(touchedView);
                        printf("updatevie1w");
                        openHomeMenuItem(touchedView->tag);
                        g_last_touched_icon = touchedView;
                    }
                }
                else {
                    // --- FINGER UP (Release) ---
                    if (g_last_touched_icon != NULL && openedApp == false) {
                        if (g_last_touched_icon->backgroundColor) free(g_last_touched_icon->backgroundColor);
                        g_last_touched_icon->backgroundColor = color(0,0,0,0);
                        update_view_area_via_parent(g_last_touched_icon);
                        g_last_touched_icon = NULL;
                    }
                    is_currently_pressed = false;
                }
            }
            else if (currentView == CurrentViewFiles || currentView == CurrentViewSettings  || currentView == CurrentViewCalculator  || currentView == CurrentViewMusic  || currentView == CurrentViewPhotos || currentView == CurrentViewText || currentView == CurrentViewClock || currentView == CurrentViewPaint) {
                //else if (currentView == CurrentViewFiles || currentView == CurrentViewSettings)
                if (touch_data.touch_count > 0 && setupui == true) {
                    int x = touch_data.tp[0].x;
                    int y = touch_data.tp[0].y;
                    
                    checkAvailableMemory();
                    
                    if (x < 40 && y < 30) {
                        close_current_app();
                    }
                    if (currentView == CurrentViewFiles) {
                        handle_files_touch(x, y, is_currently_pressed);
                    }
                    if (currentView == CurrentViewSettings) {
                        handle_settings_touch(x, y, 1);
                    }
                    if (currentView == CurrentViewPhotos) {
                        CCView* row = find_subview_at_point(mainWindowView, x, y);
                        if (row) {
                            handle_gallery_touch(row->tag);
                        }
                    }
                    if (currentView == CurrentViewCalculator) {
                        CCView* row = find_subview_at_point(mainWindowView, x, y);
                        if (row) {
                            handle_calculator_input(row->tag);
                        }
                    }
                    if (currentView == CurrentViewClock) {
                        printf("CurrentViewClock");
                        handle_clock_touch(x, y, is_currently_pressed);
                    }
                    if (currentView == CurrentViewPaint) {
                        handle_paint_touch(x, y, is_currently_pressed);
                    }
                    if (currentView == CurrentViewMusic) {
                        handle_music_touch(x, y, is_currently_pressed);
                    }
                    
                }
                else {
                    
                }
            }
            else if (currentView == CurrentViewWifi) {
                if (touch_data.touch_count > 0 && setupui == true) {
                    int x = touch_data.tp[0].x;
                    int y = touch_data.tp[0].y;
                    
                    checkAvailableMemory();
                    
                    if (appTouchEnabled == true) {
                        appTouchEnabled = false;
                        handle_wifi_touch(x, y);
                    }
                    
                }
                else {
                    appTouchEnabled = true;
                }
            }
            
            
        }
        

        
        
        
        
        
    }
}



// ----------------------------------------------------------------------
// INITIALIZATION FUNCTION
// Call this function from your app_main
// ----------------------------------------------------------------------
/*void initialize_touch()
 {
 FreeOSLogI(TAG, "Initializing I2C Master for touch panel");
 
 // --- 1. Create the new I2C Master Bus ---
 i2c_master_bus_config_t bus_cfg = {
 .i2c_port = I2C_HOST,
 .scl_io_num = PIN_NUM_I2C_SCL,
 .sda_io_num = PIN_NUM_I2C_SDA,
 .clk_source = I2C_CLK_SRC_DEFAULT,
 .glitch_ignore_cnt = 7,
 .flags.enable_internal_pullup = true,
 };
 i2c_master_bus_handle_t bus_handle;
 ESP_ERROR_CHECK(i2c_new_master_bus(&bus_cfg, &bus_handle));
 
 // --- 2. Create the I2C Panel IO Handle (THE MISSING STEP) ---
 FreeOSLogI(TAG, "Creating I2C panel IO handle");
 esp_lcd_panel_io_handle_t io_handle = NULL;
 esp_lcd_panel_io_i2c_config_t io_config = ESP_LCD_TOUCH_IO_I2C_FT6x36_CONFIG();
 
 io_config.scl_speed_hz = 400000;
 
