playrinc/FreeOS/main/ESP32Support.c
 // This is the line you were missing.
 // It creates the actual IO device handle.
 ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(bus_handle, &io_config, &io_handle));
 
 // --- 3. Configure and Initialize the Touch Controller ---
 esp_lcd_touch_config_t tp_cfg = {
 .x_max = LCD_H_RES,
 .y_max = LCD_V_RES,
 .rst_gpio_num = -1,//PIN_NUM_TOUCH_RST,
 .int_gpio_num = PIN_NUM_TOUCH_INT,
 .levels = {
 .reset = 0,
 .interrupt = 0,
 },
 .flags = {
 .swap_xy = 0,
 .mirror_x = 0,
 .mirror_y = 0,
 },
 };
 
 esp_lcd_touch_handle_t tp; // <-- Your handle is named 'tp'
 // Now you are passing the *valid* io_handle
 esp_err_t err = esp_lcd_touch_new_i2c_ft6x36(io_handle, &tp_cfg, &tp);
 
 if (err != ESP_OK) {
 FreeOSLogE(TAG, "Touch panel init failed, continuing without touch...");
 } else {
 FreeOSLogI(TAG, "Touch panel initialized successfully");
 
 // --- 4. Register Touch Input with LVGL ---
 FreeOSLogI(TAG, "Registering touch input with LVGL");
 
 lvgl_touch_indev = lv_indev_create();
 lv_indev_set_type(lvgl_touch_indev, LV_INDEV_TYPE_POINTER);
 lv_indev_set_read_cb(lvgl_touch_indev, lvgl_touch_cb);
 
 // *** FIX 2 (Typo) ***
 // Pass the handle you just created, which is 'tp', not 'tp_handle'
 lv_indev_set_user_data(lvgl_touch_indev, tp);
 
 // (Rest of your LVGL code...)
 }
 }*/

//Joystick

// Define the GPIOs and their corresponding ADC Channels
#define JOY_X_PIN  ADC_CHANNEL_3 // GPIO4 corresponds to ADC1 Channel 3
#define JOY_Y_PIN  ADC_CHANNEL_4 // GPIO5 corresponds to ADC1 Channel 4

// ADC handle and configuration structures
adc_oneshot_unit_handle_t adc1_handle;

#define DEFAULT_SCAN_LIST_SIZE CONFIG_EXAMPLE_SCAN_LIST_SIZE

#ifdef CONFIG_EXAMPLE_USE_SCAN_CHANNEL_BITMAP
#define USE_CHANNEL_BITMAP 1
#define CHANNEL_LIST_SIZE 3
static uint8_t channel_list[CHANNEL_LIST_SIZE] = {1, 6, 11};
#endif /*CONFIG_EXAMPLE_USE_SCAN_CHANNEL_BITMAP*/



static void print_auth_mode(int authmode)
{
    switch (authmode) {
        case WIFI_AUTH_OPEN:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_OPEN");
            break;
        case WIFI_AUTH_OWE:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_OWE");
            break;
        case WIFI_AUTH_WEP:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_WEP");
            break;
        case WIFI_AUTH_WPA_PSK:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_WPA_PSK");
            break;
        case WIFI_AUTH_WPA2_PSK:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_WPA2_PSK");
            break;
        case WIFI_AUTH_WPA_WPA2_PSK:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_WPA_WPA2_PSK");
            break;
        case WIFI_AUTH_ENTERPRISE:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_ENTERPRISE");
            break;
        case WIFI_AUTH_WPA3_PSK:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_WPA3_PSK");
            break;
        case WIFI_AUTH_WPA2_WPA3_PSK:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_WPA2_WPA3_PSK");
            break;
        case WIFI_AUTH_WPA3_ENTERPRISE:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_WPA3_ENTERPRISE");
            break;
        case WIFI_AUTH_WPA2_WPA3_ENTERPRISE:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_WPA2_WPA3_ENTERPRISE");
            break;
        case WIFI_AUTH_WPA3_ENT_192:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_WPA3_ENT_192");
            break;
        default:
            FreeOSLogI(TAG, "Authmode \tWIFI_AUTH_UNKNOWN");
            break;
    }
}

static void print_cipher_type(int pairwise_cipher, int group_cipher)
{
    switch (pairwise_cipher) {
        case WIFI_CIPHER_TYPE_NONE:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_NONE");
            break;
        case WIFI_CIPHER_TYPE_WEP40:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_WEP40");
            break;
        case WIFI_CIPHER_TYPE_WEP104:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_WEP104");
            break;
        case WIFI_CIPHER_TYPE_TKIP:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_TKIP");
            break;
        case WIFI_CIPHER_TYPE_CCMP:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_CCMP");
            break;
        case WIFI_CIPHER_TYPE_TKIP_CCMP:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_TKIP_CCMP");
            break;
        case WIFI_CIPHER_TYPE_AES_CMAC128:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_AES_CMAC128");
            break;
        case WIFI_CIPHER_TYPE_SMS4:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_SMS4");
            break;
        case WIFI_CIPHER_TYPE_GCMP:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_GCMP");
            break;
        case WIFI_CIPHER_TYPE_GCMP256:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_GCMP256");
            break;
        default:
            FreeOSLogI(TAG, "Pairwise Cipher \tWIFI_CIPHER_TYPE_UNKNOWN");
            break;
    }
    
    switch (group_cipher) {
        case WIFI_CIPHER_TYPE_NONE:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_NONE");
            break;
        case WIFI_CIPHER_TYPE_WEP40:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_WEP40");
            break;
        case WIFI_CIPHER_TYPE_WEP104:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_WEP104");
            break;
        case WIFI_CIPHER_TYPE_TKIP:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_TKIP");
            break;
        case WIFI_CIPHER_TYPE_CCMP:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_CCMP");
            break;
        case WIFI_CIPHER_TYPE_TKIP_CCMP:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_TKIP_CCMP");
            break;
        case WIFI_CIPHER_TYPE_SMS4:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_SMS4");
            break;
        case WIFI_CIPHER_TYPE_GCMP:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_GCMP");
            break;
        case WIFI_CIPHER_TYPE_GCMP256:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_GCMP256");
            break;
        default:
            FreeOSLogI(TAG, "Group Cipher \tWIFI_CIPHER_TYPE_UNKNOWN");
            break;
    }
}

#ifdef USE_CHANNEL_BITMAP
static void array_2_channel_bitmap(const uint8_t channel_list[], const uint8_t channel_list_size, wifi_scan_config_t *scan_config) {
    
    for(uint8_t i = 0; i < channel_list_size; i++) {
        uint8_t channel = channel_list[i];
        scan_config->channel_bitmap.ghz_2_channels |= (1 << channel);
    }
}
#endif /*USE_CHANNEL_BITMAP*/


/* Initialize Wi-Fi as sta and set scan method */
static void wifi_scan(void)
{
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    esp_netif_t *sta_netif = esp_netif_create_default_wifi_sta();
    assert(sta_netif);
    
