playrinc/FreeOS/main/ESP32Support.c
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    
    uint16_t number = DEFAULT_SCAN_LIST_SIZE;
    wifi_ap_record_t ap_info[DEFAULT_SCAN_LIST_SIZE];
    uint16_t ap_count = 0;
    memset(ap_info, 0, sizeof(ap_info));
    
    
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_start());
    
#ifdef USE_CHANNEL_BITMAP
    wifi_scan_config_t *scan_config = (wifi_scan_config_t *)calloc(1,sizeof(wifi_scan_config_t));
    if (!scan_config) {
        FreeOSLogE(TAG, "Memory Allocation for scan config failed!");
        return;
    }
    array_2_channel_bitmap(channel_list, CHANNEL_LIST_SIZE, scan_config);
    esp_wifi_scan_start(scan_config, true);
    free(scan_config);
    
#else
    esp_wifi_scan_start(NULL, true);
#endif /*USE_CHANNEL_BITMAP*/
    
    FreeOSLogI(TAG, "Max AP number ap_info can hold = %u", number);
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_num(&ap_count));
    ESP_ERROR_CHECK(esp_wifi_scan_get_ap_records(&number, ap_info));
    FreeOSLogI(TAG, "Total APs scanned = %u, actual AP number ap_info holds = %u", ap_count, number);
    for (int i = 0; i < number; i++) {
        FreeOSLogI(TAG, "SSID \t\t%s", ap_info[i].ssid);
        FreeOSLogI(TAG, "RSSI \t\t%d", ap_info[i].rssi);
        print_auth_mode(ap_info[i].authmode);
        if (ap_info[i].authmode != WIFI_AUTH_WEP) {
            print_cipher_type(ap_info[i].pairwise_cipher, ap_info[i].group_cipher);
        }
        FreeOSLogI(TAG, "Channel \t\t%d", ap_info[i].primary);
    }
}



/**
 * @brief Initializes and mounts the FATFS partition using the Wear Leveling driver.
 */
void mount_fatfs(void) {
    // Configuration for the mount (Ensure CONFIG_WL_SECTOR_SIZE is set in menuconfig)
    /*const esp_vfs_fat_mount_config_t mount_config = {
     .max_files = 10000,
     .format_if_mount_failed = false, // Format if initial mount fails (enables writing)
     .allocation_unit_size = CONFIG_WL_SECTOR_SIZE
     };*/
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 100
    };
    
    FreeOSLogI(TAG, "Mounting FATFS partition '%s' at %s...", PARTITION_LABEL, MOUNT_POINT);
    
    // Mount the FAT partition with Read/Write (RW) and Wear Leveling (WL) support
    /*esp_err_t ret = esp_vfs_fat_spiflash_mount_rw_wl(
     MOUNT_POINT,        // Base path (e.g., /fat)
     PARTITION_LABEL,    // Partition Label (e.g., fat_data)
     &mount_config,
     &wl_handle          // Wear Leveling handle (output)
     );*/
    
    esp_err_t ret = esp_vfs_fat_spiflash_mount_ro("/spiflash", "storage", &mount_config);
    
    if (ret != ESP_OK) {
        FreeOSLogE(TAG, "Failed to mount FATFS (%s)", esp_err_to_name(ret));
    } else {
        FreeOSLogI(TAG, "FATFS mounted successfully.");
    }
}


void checkAvailableMemory() {
    size_t free_heap_size = heap_caps_get_free_size(MALLOC_CAP_8BIT);
    printf("Free heap size: %zu bytes\n", free_heap_size);
    size_t free_heap_size1 = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
    printf("Free heap size spiram: %zu bytes\n", free_heap_size1);
    size_t free_heap_size2 = heap_caps_get_free_size(MALLOC_CAP_EXEC);
    printf("Free heap size MALLOC_CAP_EXEC: %zu bytes\n", free_heap_size2);
    // Optionally, you can print other heap info
    size_t free_internal_heap_size = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
    printf("Free internal heap size: %zu bytes\n", free_internal_heap_size);
    printf("Free heap size: %zu bytes\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
    
    FreeOSLogI(TAG, "Free heap size: %zu bytes\n", free_heap_size);
    FreeOSLogI(TAG, "Free internal heap size: %zu bytes\n", free_internal_heap_size);
    
    //FreeOSLogI(TAG, "EXECUTABLE 2\n");
    
}

// Function to draw a block of pixels (240x240)
void raw_drawing_task(void *pvParameter)
{
    FreeOSLogI(TAG, "Starting raw drawing demo.");
    
    // Create a pixel buffer for the entire screen (240 * 240 pixels * 2 bytes/pixel)
    // This is a large buffer, ensure your PSRAM is enabled/available.
    // If you don't have enough RAM/PSRAM, reduce the size or use a small tile.
    uint16_t *color_data = (uint16_t *)heap_caps_malloc(LCD_H_RES * LCD_V_RES * sizeof(uint16_t), MALLOC_CAP_DMA);
    if (!color_data) {
        FreeOSLogE(TAG, "Failed to allocate display buffer!");
        vTaskDelete(NULL);
        return;
    }
    
    // Fill the buffer with the color red (0xF800)
    for (int i = 0; i < LCD_H_RES * LCD_V_RES; i++) {
        color_data[i] = LCD_COLOR_RED;
    }
    
    // Draw the bitmap once per second
    while (1) {
        // Function: esp_lcd_panel_draw_bitmap(panel_handle, x_start, y_start, x_end, y_end, color_data)
        ESP_ERROR_CHECK(esp_lcd_panel_draw_bitmap(
                                                  panel_handle,
                                                  0,                 // x_start
                                                  0,                 // y_start
                                                  LCD_H_RES,         // x_end (Exclusive, so 240 is 0-239)
                                                  LCD_V_RES,         // y_end (Exclusive, so 240 is 0-239)
                                                  color_data
                                                  ));
        
        FreeOSLogI(TAG, "Drew a red screen.");
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
    // Note: In a real app, you would free the memory before deleting the task.
}

/*void lvgl_ui_task(void *pvParameter) {
 // *** LVGL UI Creation Code Goes Here ***
 lv_obj_t *label = lv_label_create(lv_screen_active());
 lv_label_set_text(label, "LVGL is Running!");
 lv_obj_center(label);
 
 // LVGL main loop handler
 while(1) {
 lv_timer_handler(); // Processes all LVGL tasks and redrawing
 vTaskDelay(pdMS_TO_TICKS(5)); // Wait 5ms
 }
 }*/


// Style for small, normal weight text (e.g., 18px)
static lv_style_t style_normal;

// Style for large, bold/heavy text (e.g., 36px)
static lv_style_t style_heavy;

