playrinc/FreeOS/main/ESP32Support.c
// Style for medium, light/thin text (e.g., 24px)
static lv_style_t style_light;

/**
 * @brief Initialize all custom LVGL styles.
 */
static void init_custom_styles()
{
    // --- Normal Style (Montserrat 18) ---
    lv_style_init(&style_normal);
    // Use the built-in Montserrat font with size 18 and a medium/normal weight.
    lv_style_set_text_font(&style_normal, &lv_font_montserrat_8);
    lv_style_set_text_color(&style_normal, lv_color_white());
    
    // --- Heavy Style (Montserrat 36) ---
    lv_style_init(&style_heavy);
    // Use the largest, heaviest weight available (Montserrat 36)
    lv_style_set_text_font(&style_heavy, &lv_font_montserrat_10);
    lv_style_set_text_color(&style_heavy, lv_color_hex(0xFFDD00)); // Yellowish
    
    // --- Light Style (Montserrat 24) ---
    lv_style_init(&style_light);
    // Use Montserrat 24. Since LVGL doesn't have explicit 'light' weight files
    // for all sizes, we use the default and often customize it further if needed.
    // However, 24px is a distinct size from 18 and 36.
    lv_style_set_text_font(&style_light, &lv_font_montserrat_12);
    lv_style_set_text_color(&style_light, lv_color_hex(0xAAAAAA)); // Gray
}


// -----------------------------------------------------------
// 2. UI TASK FUNCTION
// -----------------------------------------------------------

/**
 * @brief LVGL UI creation and handler task.
 */
void lvgl_ui_task(void *pvParameter)
{
    FreeOSLogI(TAG, "LVGL UI Task started.");
    
    // Lock the LVGL mutex before accessing any LVGL objects
    lvgl_port_lock(0);
    
    // 1. Initialize styles
    init_custom_styles();
    
    lv_obj_t *scr = lv_screen_active();
    lv_obj_set_style_bg_color(scr, lv_color_hex(0x002244), 0); // Dark Blue background
    
    // --- LABEL 1: Large & Heavy ---
    lv_obj_t *label1 = lv_label_create(scr);
    lv_label_set_text(label1, "SYSTEM ONLINE");
    lv_obj_add_style(label1, &style_heavy, 0); // Apply the heavy style
    lv_obj_align(label1, LV_ALIGN_TOP_MID, 0, 10);
    
    // --- LABEL 2: Medium & Light ---
    lv_obj_t *label2 = lv_label_create(scr);
    lv_label_set_text(label2, "Meet with sales team");
    lv_obj_add_style(label2, &style_light, 0); // Apply the light style
    // Align below Label 1
    lv_obj_align_to(label2, label1, LV_ALIGN_OUT_BOTTOM_MID, 0, 10);
    
    // --- LABEL 3: Small & Normal ---
    lv_obj_t *label3 = lv_label_create(scr);
    lv_label_set_text(label3, "Powered by ESP-IDF and LVGL");
    lv_obj_add_style(label3, &style_normal, 0); // Apply the normal style
    // Align below Label 2
    lv_obj_align_to(label3, label2, LV_ALIGN_OUT_BOTTOM_MID, 0, 10);
    
    // Unlock the LVGL mutex
    lvgl_port_unlock();
    
    // -----------------------------------------------------------
    // LVGL Main Loop
    // -----------------------------------------------------------
    while(1) {
        // Must protect lv_timer_handler() with lock/unlock
        lvgl_port_lock(0);
        lv_timer_handler(); // Processes all LVGL tasks, redrawing, and animations
        lvgl_port_unlock();
        
        vTaskDelay(pdMS_TO_TICKS(5));
    }
}


// Styles (reusing simple styles, assume default LVGL fonts are available)
static lv_style_t style_main_bg;

/**
 * @brief Initializes base styles for the demo.
 */
static void init_kb_styles()
{
    lv_style_init(&style_main_bg);
    // Set background color for the screen (or container)
    lv_style_set_bg_color(&style_main_bg, lv_color_hex(0xEEEEEE));
    lv_style_set_text_color(&style_main_bg, lv_color_black());
}

// Global variables to store the latest joystick values (access must be thread-safe)
volatile int g_joystick_x = 0;
volatile int g_joystick_y = 0;

// Mutex to protect access to the global variables
SemaphoreHandle_t joystick_mutex;

lv_obj_t *g_cursor_obj;
volatile lv_coord_t g_cursor_x_pos; // Manual cursor position tracker
volatile lv_coord_t g_cursor_y_pos; // Manual cursor position tracker

// Joystick ADC Range
#define JOY_X_MIN 1000
#define JOY_X_MAX 3200
#define JOY_Y_MIN 600
#define JOY_Y_MAX 3600

#define JOY_X_LEFT 1100 //200 to 1100, move left if less than 1100
#define JOY_X_NEUTRAL 1600 //1500 to 2400, do not move cursor on x axis if joystick x between these values
#define JOY_X_RIGHT 2600 //2800 to 3600, move right if greater than 2800
#define JOY_Y_DOWN 1400 //600 to 1200, move down if less than 1200
#define JOY_Y_NEUTRAL 1800 //1700 to 2600, do not move cursor on y axis if joystick y between these values
#define JOY_Y_UP 2800 //2800 to 4000, move up if greater than 2800

// Screen Resolution (Adjust these to your actual display size)
#define SCREEN_WIDTH 240  // Example: 320 pixels wide
#define SCREEN_HEIGHT 320 // Example: 240 pixels high

/**
 * @brief LVGL UI creation and handler task, focusing on the keyboard.
 */
void lvgl_ui_task1(void *pvParameter)
{
    FreeOSLogI(TAG, "LVGL Keyboard Demo Task started.");
    
    //lvgl_port_lock(0);
    lv_lock();
    init_kb_styles();
    
    lv_obj_t *scr = lv_screen_active();
    lv_obj_add_style(scr, &style_main_bg, 0);
    
    // 1. Create a Text Area (Input Field)
    // This is where the user's input will appear.
    lv_obj_t *ta = lv_textarea_create(scr);
    lv_textarea_set_text_selection(ta, true);
    
    // Set the size and position of the text area
    lv_obj_set_width(ta, lv_pct(90));
    lv_obj_set_height(ta, LV_SIZE_CONTENT);
    lv_obj_align(ta, LV_ALIGN_TOP_MID, 0, 10);
    
    lv_textarea_set_placeholder_text(ta, "Tap here to type...");
    lv_textarea_set_one_line(ta, true); // Keep it simple
    
    // 2. Create the Keyboard
    // This creates the virtual keyboard widget.
    lv_obj_t *kb = lv_keyboard_create(scr);
    
    // Set the size: full width and align it to the bottom
    lv_obj_set_width(kb, LV_PCT(100));
    lv_obj_set_height(kb, lv_pct(50));
    lv_obj_align(kb, LV_ALIGN_BOTTOM_MID, 0, 0);
    
    // 3. Link the Keyboard to the Text Area
    // This tells the keyboard where to send its input.
    lv_keyboard_set_textarea(kb, ta);
    
    // 4. Set Initial Focus
    // Set the text area as the initially focused object so the keyboard is ready.
    lv_obj_add_state(ta, LV_STATE_FOCUSED);
    
    // Global handle for the cursor object (declared outside of the function)
    g_cursor_obj = NULL;
    
    // --- Cursor Style ---
    lv_style_t style_cursor;
    lv_style_init(&style_cursor);
    lv_style_set_bg_color(&style_cursor, lv_color_white()); // Small white circle
    lv_style_set_border_width(&style_cursor, 2);
    lv_style_set_border_color(&style_cursor, lv_color_black()); // Black border
    lv_style_set_radius(&style_cursor, LV_RADIUS_CIRCLE); // Makes it a perfect circle
    lv_style_set_pad_all(&style_cursor, 0); // No padding
    
    // --- Cursor Object Creation ---
    g_cursor_obj = lv_obj_create(scr); // Create as a simple object on the screen
    lv_obj_set_size(g_cursor_obj, 10, 10); // Set size (e.g., 10x10 pixels)
    lv_obj_add_style(g_cursor_obj, &style_cursor, 0);
    lv_obj_set_pos(g_cursor_obj, SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2); // Start at the center
    lv_obj_move_foreground(g_cursor_obj); // Ensures the cursor is drawn on top
    
    
