playrinc/FreeOS/main/ESP32Support.c
    //lvgl_port_unlock();
    lv_unlock();
    
    //vTaskDelete(NULL);
    
    // LVGL Main Loop
    while(1) {
        lv_lock();
        lv_timer_handler();
        lv_unlock();
        
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    
    // LVGL Main Loop
    // LVGL Main Loop
    //while(1) {
    /*
     // --- 1. Read Joystick Position Safely (RAW VALUES) ---
     int raw_x = g_joystick_x; // Initialize with current global value
     int raw_y = g_joystick_y;
     
     // Safely retrieve the latest global values
     if (xSemaphoreTake(joystick_mutex, QUEUE_MAX_DELAY) == pdTRUE) {
     raw_x = g_joystick_x;
     raw_y = g_joystick_y;
     xSemaphoreGive(joystick_mutex);
     }
     
     // --- 2. Rate Control Logic (Analog to Digital Step) ---
     int move_x = 0;
     int move_y = 0;
     
     // --- X-Axis (Horizontal) ---
     if (raw_x < JOY_X_LEFT) {
     move_x = -1; // Move Left
     } else if (raw_x > JOY_X_RIGHT) {
     move_x = 1;  // Move Right
     }
     
     // --- Y-Axis (Vertical) ---
     // Note: LVGL Y=0 is TOP. Y_UP (high ADC) should move cursor toward Y=0 (move_y = -1).
     if (raw_y > JOY_Y_UP) {
     move_y = -1; // Move UP (towards Y=0)
     } else if (raw_y < JOY_Y_DOWN) {
     move_y = 1;  // Move DOWN (towards Y=HEIGHT)
     }
     
     // --- 3. Acquire the LVGL Lock, Update Position, and Handle Tick ---
     lvgl_port_lock(0);
     
     if (g_cursor_obj != NULL) {
     
     // Check if movement is needed
     if (move_x != 0 || move_y != 0) {
     
     // Update the cursor's internal tracked position
     g_cursor_x_pos += move_x;
     g_cursor_y_pos += move_y;
     
     // Clamp position to screen boundaries (ensures cursor stays visible)
     const int cursor_center_offset = 5; // For a 10x10 cursor
     if (g_cursor_x_pos < cursor_center_offset) g_cursor_x_pos = cursor_center_offset;
     if (g_cursor_x_pos > SCREEN_WIDTH - cursor_center_offset) g_cursor_x_pos = SCREEN_WIDTH - cursor_center_offset;
     if (g_cursor_y_pos < cursor_center_offset) g_cursor_y_pos = cursor_center_offset;
     if (g_cursor_y_pos > SCREEN_HEIGHT - cursor_center_offset) g_cursor_y_pos = SCREEN_HEIGHT - cursor_center_offset;
     
     // Set the LVGL object position
     lv_obj_set_pos(g_cursor_obj, g_cursor_x_pos - cursor_center_offset, g_cursor_y_pos - cursor_center_offset);
     }
     }
     
     lv_timer_handler(); // Handle the LVGL tick
     
     lvgl_port_unlock();
     
     // Control cursor speed by yielding (5ms delay = 200 updates per second)
     vTaskDelay(pdMS_TO_TICKS(5));*/
    
    //lv_timer_handler();
    //vTaskDelay(pdMS_TO_TICKS(5));
    //}
    
}



void joystick_task(void *pvParameter)
{
    // --- 1. ADC Unit Initialization ---
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = ADC_UNIT_1, // Use ADC1
        .clk_src = ADC_DIGI_CLK_SRC_DEFAULT,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config, &adc1_handle));
    
    // --- 2. ADC Channel Configuration (X-Axis: GPIO4) ---
    adc_oneshot_chan_cfg_t chan_config_x = {
        .atten = ADC_ATTEN_DB_11, // Attenuation for 0V ~ 3.3V range
        .bitwidth = ADC_BITWIDTH_DEFAULT, // Default is 12-bit (0-4095)
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, JOY_X_PIN, &chan_config_x));
    
    // --- 3. ADC Channel Configuration (Y-Axis: GPIO5) ---
    adc_oneshot_chan_cfg_t chan_config_y = {
        .atten = ADC_ATTEN_DB_11, // Same attenuation
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, JOY_Y_PIN, &chan_config_y));
    
    joystick_mutex = xSemaphoreCreateMutex();
    
    while (1) {
        int adc_raw_x = 0;
        int adc_raw_y = 0;
        
        // Read the joystick values
        // Note: Check for ESP_OK error return here for production code
        adc_oneshot_read(adc1_handle, JOY_X_PIN, &adc_raw_x);
        adc_oneshot_read(adc1_handle, JOY_Y_PIN, &adc_raw_y);
        
        // =======================================================
        // ✨ NEW LINE ADDED HERE TO GENERATE LOG OUTPUT
        // =======================================================
        FreeOSLogI(TAG, "X-Axis Raw: %d | Y-Axis Raw: %d", adc_raw_x, adc_raw_y);
        // =======================================================
        
        // Safely update global variables
        if (xSemaphoreTake(joystick_mutex, QUEUE_MAX_DELAY) == pdTRUE) {
            g_joystick_x = adc_raw_x;
            g_joystick_y = adc_raw_y;
            xSemaphoreGive(joystick_mutex);
        }
        
        // Delay to prevent the task from consuming too much CPU time
        vTaskDelay(pdMS_TO_TICKS(50)); // Read the joystick every 50ms
    }
}

void initializeUIST7789(void) {
    // 1. Initialize SPI Bus
    const spi_bus_config_t bus_config = {
        .mosi_io_num = PIN_NUM_MOSI,
        .miso_io_num = -1,
        .sclk_io_num = PIN_NUM_CLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 0, // Set to 0 to allow max size transfer
    };
    ESP_ERROR_CHECK(spi_bus_initialize(SPI2_HOST, &bus_config, SPI_DMA_CH_AUTO));
    
    // 2. Initialize LCD Panel I/O (Interface to the ST7789)
    const esp_lcd_panel_io_spi_config_t io_config = {
        .cs_gpio_num = PIN_NUM_CS,
        .dc_gpio_num = PIN_NUM_DC,
        .spi_mode = 0,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
        .trans_queue_depth = 10,
        .on_color_trans_done = NULL,
        .pclk_hz = LCD_PIXEL_CLOCK_HZ, // Corrected clock field name
    };
    esp_lcd_panel_io_handle_t io_handle = NULL;
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)SPI2_HOST, &io_config, &io_handle));
    
    // 3. Initialize LCD Driver
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = PIN_NUM_RST,
        .bits_per_pixel = 16,
        .color_space = ESP_LCD_COLOR_SPACE_BGR,
    };
    
    const size_t ili9488_buffer_size = 0;
    // Conditional compilation for the driver initialization
#if defined(USE_ILI9488)
    ESP_ERROR_CHECK(esp_lcd_new_panel_ili9488(io_handle, &panel_config, ili9488_buffer_size, &panel_handle));
    
