playrinc/FreeOS/main/ESP32Support.c
#elif defined(USE_ST7789)
    // The ST7789 function does not take the buffer_size argument
    ESP_ERROR_CHECK(esp_lcd_new_panel_st7789(io_handle, &panel_config, &panel_handle));
#endif
    
    // 4. Panel Initialization (Reset and basic setup commands)
    esp_lcd_panel_reset(panel_handle);
    esp_lcd_panel_init(panel_handle);
    esp_lcd_panel_swap_xy(panel_handle, true); // Often needed for orientation
    esp_lcd_panel_set_gap(panel_handle, 0, 0);
#if defined(USE_ST7789)
    esp_lcd_panel_invert_color(panel_handle, true);
#endif
    esp_lcd_panel_disp_on_off(panel_handle, true);
    
    
#define LVGL_DISP_BUF_SIZE  (LCD_H_RES * LCD_V_RES / 10) // E.g., 1/10th of screen
    
    // 1. Initialize LVGL Core
    const lvgl_port_cfg_t lvgl_cfg = ESP_LVGL_PORT_INIT_CONFIG();
    // Use the port init function to set up the LVGL task and tick source
    lvgl_port_init(&lvgl_cfg);
    
    // 2. Register Display with LVGL Porting Layer
    const lvgl_port_display_cfg_t disp_cfg = {
        .io_handle = io_handle,
        .panel_handle = panel_handle,
        .control_handle = NULL, // Generally unused for basic SPI display
        
        // --- Memory Configuration ---
        // LVGL will allocate the buffer internally based on these fields.
        .buffer_size = LVGL_DISP_BUF_SIZE,
        .double_buffer = true, // We will allocate two buffers of the size above
        .trans_size = 0,       // Optional: Set to 0 if not using a dedicated transaction buffer
        
        // --- Flags (Crucial for Byte Ordering) ---
        .flags.buff_dma = 1,
        // Set this flag to 1 (true) to swap the high and low bytes of the 16-bit color.
        // This often resolves the "fuzziness" and color mixing issues on SPI displays.
        
#if defined(USE_ILI9488)
        .flags.swap_bytes = 0,
#elif defined(USE_ST7789)
        .flags.swap_bytes = 1,
#endif
        
        // --- Display Resolution ---
        .hres = LCD_V_RES,
        .vres = LCD_H_RES,
        .monochrome = false,
        
        // --- LVGL v9 Configuration ---
        .color_format = LV_COLOR_FORMAT_RGB565, // Use RGB565 for 16-bit color
        
        // --- Flags (Crucial for DMA and memory location) ---
        .flags.buff_dma = 1,    // 1: Allocate buffers in DMA-capable memory (DRAM)
        .flags.buff_spiram = 0, // 0: Do NOT allocate in PSRAM
        .flags.sw_rotate = 0,   // 0: Use hardware/driver rotation (faster)
        .flags.full_refresh = 0, // 0: Use partial refresh (more efficient)
        .flags.direct_mode = 0, // 0: Use standard buffered mode
        
        .rotation = {0}, // Use default rotation (0 degrees)
    };
    
    // Use the registration function to wire it up
    lv_display_t *disp = lvgl_port_add_disp(&disp_cfg);
    
    
    
    // 3. Start your LVGL UI Task
    xTaskCreate(lvgl_ui_task1, "LVGL_UI_Task", 8192, NULL, 5, NULL);
}

#include "driver/i2c_master.h" // <-- Use this new header

// Make sure these are defined correctly for your board
#define I2C_MASTER_SCL_IO   PIN_NUM_I2C_SCL
#define I2C_MASTER_SDA_IO   PIN_NUM_I2C_SDA
#define I2C_MASTER_NUM      I2C_HOST // Use the same I2C port

/**
 * @brief i2c master scanner (using new "next-gen" driver)
 */
static void i2c_scan_ng(void)
{
    FreeOSLogI(TAG, "Starting I2C scan (NG Driver)...");
    
    // 1. Create the bus configuration
    i2c_master_bus_config_t bus_cfg = {
        .i2c_port = I2C_MASTER_NUM,
        .scl_io_num = I2C_MASTER_SCL_IO,
        .sda_io_num = I2C_MASTER_SDA_IO,
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    i2c_master_bus_handle_t bus_handle;
    ESP_ERROR_CHECK(i2c_new_master_bus(&bus_cfg, &bus_handle));
    
    FreeOSLogI(TAG, "Scanning for I2C devices...");
    
    for (uint8_t address = 1; address < 127; address++) {
        // 2. Probe the address. This function sends the address and checks for an ACK.
        // 50ms timeout is more than enough.
        esp_err_t ret = i2c_master_probe(bus_handle, address, 50);
        
        if (ret == ESP_OK) {
            FreeOSLogI(TAG, "I2C device found at address 0x%02X", address);
        } else if (ret != ESP_ERR_TIMEOUT && ret != ESP_ERR_NOT_FOUND) {
            // Log other errors if they occur
            ESP_LOGW(TAG, "Error 0x%X checking address 0x%02X", ret, address);
        }
    }
    
    // 3. Clean up the bus
    ESP_ERROR_CHECK(i2c_del_master_bus(bus_handle));
    FreeOSLogI(TAG, "I2C scan complete.");
}



/**
 * @brief GPIO Interrupt Service Routine
 * This is called *every* time the INT_N_PIN goes LOW.
 */
static void IRAM_ATTR gpio_isr_handler(void *arg) {
    uint32_t gpio_num = (uint32_t)arg;
    if (gpio_num == INT_N_PIN) {
        // Send an event to the touch task
        // A non-zero value is posted to wake up the task
        static uint32_t event = 1;
        QueueSendFromISR(touch_intr_queue, &event, NULL);
    }
}

/**
 * @brief Task to process touch events
 * This task waits for an event from the ISR queue.
 */
static void touch_task(void *arg) {
    uint32_t event;
    FT6336U_TouchPointType touch_data;
    
    while (1) {
        // Wait for an interrupt event from the queue
        if (xQueueReceive(touch_intr_queue, &event, QUEUE_MAX_DELAY)) {
            
            // Interrupt received, scan the touch controller
            esp_err_t ret = ft6336u_scan(&touch_dev, &touch_data);
            if (ret != ESP_OK) {
                FreeOSLogE(TAG, "Failed to scan touch: %s", esp_err_to_name(ret));
                continue;
            }
            
            // --- LVGL BRIDGE: UPDATE STATE ---
            // Instead of logging, we now update the static variables
            if (touch_data.touch_count == 0) {
                g_last_state = LV_INDEV_STATE_REL; // Released
            } else {
                // Use the first touch point
                g_last_x = touch_data.tp[0].x;
                g_last_y = touch_data.tp[0].y;
                g_last_state = LV_INDEV_STATE_PR; // Pressed
            }
            // --- END LVGL BRIDGE ---
            
