playrinc/FreeOS/main/ESP32Support.c
            if (touch_data.touch_count == 0) {
                // FreeOSLogI(TAG, "Touch Released");
            } else {
                for (int i = 0; i < touch_data.touch_count; i++) {
                    FreeOSLogI(TAG, "Touch %d: (%s) X=%u, Y=%u",
                             i,
                             (touch_data.tp[i].status == touch) ? "NEW" : "STREAM",
                             touch_data.tp[i].x,
                             touch_data.tp[i].y);
                }
            }
        }
    }
}

/**
 * @brief Initialize the I2C master bus
 */
/*esp_err_t i2c_master_init(void) {
 i2c_master_bus_config_t i2c_bus_config = {
 .i2c_port = I2C_HOST,
 .sda_io_num = I2C_SDA_PIN,
 .scl_io_num = I2C_SCL_PIN,
 .clk_source = I2C_CLK_SRC_DEFAULT,
 .glitch_ignore_cnt = 7, // Corrected: Was .glitch_ignore_cfg.flags.val = 0
 .intr_priority = 0,     // Use 0 for default priority
 .flags.enable_internal_pullup = true // Enable internal pullups
 // Removed non-existent fields:
 // .scl_pulse_period_us
 // .sda_pulse_period_us
 // .intr_flags
 };
 
 esp_err_t ret = i2c_new_master_bus(&i2c_bus_config, &i2c_bus_handle);
 if (ret != ESP_OK) {
 FreeOSLogE(TAG, "Failed to create I2C master bus: %s", esp_err_to_name(ret));
 }
 return ret;
 }
 */

/**
 * @brief Initializes just the FT6336U chip
 */
esp_err_t ft6336u_driver_init(void) {
    // 1. Initialize I2C Bus
    ESP_ERROR_CHECK(i2c_master_init());
    
    // 2. Initialize FT6336U Driver
    ESP_ERROR_CHECK(ft6336u_init(&touch_dev, i2c_bus_handle, RST_N_PIN, INT_N_PIN));
    
    touch_intr_queue = QueueCreate(10, sizeof(uint32_t));
    
    FreeOSLogI(TAG, "Touch driver initialized successfully.");
    
    // 5. Configure GPIO interrupt for INT_N_PIN
    // We do this *after* the driver is init (which configures the pin)
    // We re-configure to add the interrupt
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << INT_N_PIN),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .intr_type = GPIO_INTR_NEGEDGE, // Trigger on FALLING edge
    };
    ESP_ERROR_CHECK(gpio_config(&io_conf));
    
    // 6. Install GPIO ISR service and add handler
    ESP_ERROR_CHECK(gpio_install_isr_service(0)); // 0 = default flags
    ESP_ERROR_CHECK(gpio_isr_handler_add(INT_N_PIN, gpio_isr_handler, (void *)INT_N_PIN));
    
    FreeOSLogI(TAG, "Interrupt handler installed. Ready for touch.");
    return ESP_OK;
}

/* * This function should be called ONCE during your setup,
 * right after lv_init() and after your display driver is registered.
 */
void lvgl_touch_driver_init(void) {
    // 1. Create a new input device
    lv_indev_t *indev_touchpad = lv_indev_create();
    
    // 2. Set its type to "Pointer" (e.g., a mouse or touchscreen)
    lv_indev_set_type(indev_touchpad, LV_INDEV_TYPE_POINTER);
    
    // 3. THIS IS THE CRITICAL LINE:
    //    Register your C function (lvgl_touch_read_cb) as the
    //    official callback that LVGL will use to read input.
    lv_indev_set_read_cb(indev_touchpad, lvgl_touch_read_cb);
}

void initTouch(void) {
    FreeOSLogI(TAG, "Starting FT6336U Touch Example");
    
    // 1. Initialize I2C Bus
    ESP_ERROR_CHECK(i2c_master_init());
    
    // 2. Initialize FT6336U Driver
    // We pass the bus handle, and the driver adds itself as a device
    ESP_ERROR_CHECK(ft6336u_init(&touch_dev, i2c_bus_handle, RST_N_PIN, INT_N_PIN));
    
    FreeOSLogI(TAG, "Touch driver initialized successfully.");
    
    // 3. Create the interrupt queue
    touch_intr_queue = QueueCreate(10, sizeof(uint32_t));
    
    // 4. Create the touch processing task
    xTaskCreate(touch_task, "touch_task", 4096, NULL, 5, NULL);
    
    // 5. Configure GPIO interrupt for INT_N_PIN
    // We do this *after* the driver is init (which configures the pin)
    // We re-configure to add the interrupt
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << INT_N_PIN),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .intr_type = GPIO_INTR_NEGEDGE, // Trigger on FALLING edge
    };
    ESP_ERROR_CHECK(gpio_config(&io_conf));
    
    // 6. Install GPIO ISR service and add handler
    ESP_ERROR_CHECK(gpio_install_isr_service(0)); // 0 = default flags
    ESP_ERROR_CHECK(gpio_isr_handler_add(INT_N_PIN, gpio_isr_handler, (void *)INT_N_PIN));
    
    FreeOSLogI(TAG, "Interrupt handler installed. Ready for touch.");
}


// --- PIN CONFIGURATION ---
#define I2S_BCK_IO      GPIO_NUM_39
#define I2S_WS_IO       GPIO_NUM_40 // Also known as LRCK
#define I2S_DO_IO       GPIO_NUM_41 // Also known as DIN

void i2s_task(void *args)
{
    // 1. BUFFER SETUP
    // Create a buffer for stereo samples (Left + Right)
    // 16-bit depth * 2 channels * 1024 samples
    size_t buffer_len = 1024;
    int16_t *samples = (int16_t *)calloc(buffer_len, 2 * sizeof(int16_t));
    
    // Fill buffer with a Sine Wave
    // We pre-calculate one buffer and play it repeatedly for this test
    for (int i = 0; i < buffer_len; i++) {
        float t = (float)i / SAMPLE_RATE;
        int16_t val = (int16_t)(3000.0f * sinf(2.0f * PI * WAVE_FREQ_HZ * t));
        
        // Interleaved Stereo: [Left, Right, Left, Right...]
        samples[i * 2]     = val; // Left Channel
        samples[i * 2 + 1] = val; // Right Channel
    }

    size_t bytes_written = 0;

    while (1) {
        // Write the buffer to the I2S peripheral
        // This function blocks until the DMA buffer has space
        i2s_channel_write(tx_handle, samples, buffer_len * 2 * sizeof(int16_t), &bytes_written, QUEUE_MAX_DELAY);
    }
}

void createI2STask() {
    // 2. CHANNEL CONFIGURATION
        i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
        ESP_ERROR_CHECK(i2s_new_channel(&chan_cfg, &tx_handle, NULL));

        // 3. STANDARD I2S MODE CONFIGURATION (Philips Format)
        i2s_std_config_t std_cfg = {
            .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(SAMPLE_RATE),
            .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_STEREO),
            .gpio_cfg = {
                .mclk = I2S_GPIO_UNUSED, // We are grounding SCK on the PCM5102, so MCLK is not needed
                .bclk = I2S_BCK_IO,
                .ws = I2S_WS_IO,
                .dout = I2S_DO_IO,
                .din = I2S_GPIO_UNUSED,  // We are only outputting audio
                .invert_flags = {
                    .mclk_inv = false,
                    .bclk_inv = false,
                    .ws_inv = false,
                },
            },
        };

        // 4. INITIALIZE AND ENABLE
        ESP_ERROR_CHECK(i2s_channel_init_std_mode(tx_handle, &std_cfg));
        ESP_ERROR_CHECK(i2s_channel_enable(tx_handle));

        printf("I2S initialized on BCK:%d, LRCK:%d, DIN:%d\n", I2S_BCK_IO, I2S_WS_IO, I2S_DO_IO);

