playrinc/FreeOS/main/ESP32Support.c
        // 5. START TASK
        xTaskCreate(i2s_task, "i2s_task", 4096, NULL, 5, NULL);
}



// Define your pins here
#define PIN_NUM_CLK  14
#define PIN_NUM_CMD  15
#define PIN_NUM_D0   16
#define PIN_NUM_D1   17
#define PIN_NUM_D2   18
#define PIN_NUM_D3   13

/*
 // --- 2. SD Card (SDIO 4-bit) Pin Definitions ---
 #define SDIO_PIN_NUM_CLK      5
 #define SDIO_PIN_NUM_CMD      6
 #define SDIO_PIN_NUM_D0       7
 #define SDIO_PIN_NUM_D1       8
 #define SDIO_PIN_NUM_D2       9
 #define SDIO_PIN_NUM_D3       10
 */

void mount_sd_card()
{
    esp_err_t ret;

    // Options for mounting the filesystem.
    // If format_if_mount_failed is set to true, SD card will be partitioned and
    // formatted in case when mounting fails.
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,
        .max_files = 5,
        .allocation_unit_size = 16 * 1024
    };

    // Use settings defined above to initialize SD card and mount FATFS.
    // Note: esp_vfs_fat_sdmmc_mount is an all-in-one convenience function.
    // Please check its source code and implement error recovery when developing production applications.
    
    sdmmc_card_t *card;
    const char mount_point[] = "/sdcard";
    
    // By default, SDMMC host frequency is set to 20MHz.
    // If your wires are long (>10cm), consider lowering this to 10MHz or 400kHz.
    sdmmc_host_t host = SDMMC_HOST_DEFAULT();
    host.max_freq_khz = SDMMC_FREQ_DEFAULT;
    //host.max_freq_khz = 100;

    // This is where we configure the pins
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    //slot_config.width = 4; // Using 4-bit mode
    slot_config.width = 1; // Using 4-bit mode
    
    // MAPPING THE PINS
    slot_config.clk = (gpio_num_t)PIN_NUM_CLK;
    slot_config.cmd = (gpio_num_t)PIN_NUM_CMD;
    slot_config.d0  = (gpio_num_t)PIN_NUM_D0;
    slot_config.d1  = (gpio_num_t)PIN_NUM_D1;
    slot_config.d2  = (gpio_num_t)PIN_NUM_D2;
    slot_config.d3  = (gpio_num_t)PIN_NUM_D3;
    slot_config.gpio_cd = GPIO_NUM_21;

    // CRITICAL: Enable internal pull-ups if your breakout board doesn't have them
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;

    printf("Mounting filesystem...\n");
    ret = esp_vfs_fat_sdmmc_mount(mount_point, &host, &slot_config, &mount_config, &card);

    if (ret != ESP_OK) {
        if (ret == ESP_FAIL) {
            printf("Failed to mount filesystem. \n");
        } else {
            printf("Failed to initialize the card (%s). \n", esp_err_to_name(ret));
        }
        return;
    }

    printf("Filesystem mounted\n");
    sdmmc_card_print_info(stdout, card);
}

static i2c_master_bus_handle_t audio_i2c_bus_handle;

//#include "driver/i2c_master.h"
//#include "esp_log.h"

void check_pins_1_and_2(void) {
    const char *TAG = "I2C_CHECK";
    ESP_LOGW(TAG, "--- DIAGNOSTIC: Checking Pins 1 (SCL) and 2 (SDA) ---");

    // 1. Configure the Bus specifically for these pins
    i2c_master_bus_config_t conf = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = -1,          // Auto-select port
        .scl_io_num = 1,         // <--- Pin 1
        .sda_io_num = 2,         // <--- Pin 2
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true, // Attempt to use internal pullups
    };

    i2c_master_bus_handle_t bus_handle;
    esp_err_t err = i2c_new_master_bus(&conf, &bus_handle);

    if (err != ESP_OK) {
        FreeOSLogE(TAG, "CRITICAL: Could not init I2C on Pins 1 & 2. Error: %s", esp_err_to_name(err));
        return;
    }

    // 2. Run the Scan
    int devices_found = 0;
    for (uint8_t addr = 0x01; addr < 0x7F; addr++) {
        // Probe every address
        if (i2c_master_probe(bus_handle, addr, 50) == ESP_OK) {
            FreeOSLogI(TAG, "  -> SUCCESS: Found Device at 0x%02X", addr);
            devices_found++;
        }
    }

    // 3. Report Results
    if (devices_found == 0) {
        FreeOSLogE(TAG, "FAILURE: No devices found. Pins 1 & 2 are dead or wired incorrectly.");
    } else {
        FreeOSLogI(TAG, "PASSED: Found %d device(s) on Pins 1 & 2.", devices_found);
    }

    // 4. Clean up (Release pins so your real code can use them)
    i2c_del_master_bus(bus_handle);
    ESP_LOGW(TAG, "--- DIAGNOSTIC COMPLETE ---");
}

// Add these defines if not already in your file
#define ES8311_ADDR 0x18

void initEs8311(void) {
    FreeOSLogI("AUDIO", "Initializing ES8311...");

    // 1. Create the I2C Bus Handle (Standard for IDF 5.x)
    // We recreate the bus here because the diagnostic tool closed its temporary one.
    i2c_master_bus_config_t i2c_bus_config = {
        .i2c_port = -1,
        .sda_io_num = 2,  // GPIO 2
        .scl_io_num = 1,  // GPIO 1
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .glitch_ignore_cnt = 7,
    };
    
    // Create the global handle (make sure 'audio_i2c_bus_handle' is defined at top of file)
    ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_bus_config, &audio_i2c_bus_handle));

    // 2. Create the Device Handle
    es8311_handle_t es_handle = es8311_create(audio_i2c_bus_handle, ES8311_ADDR);

    // 3. Configure Clock (CRITICAL FIX: frequency MUST be set)
    es8311_clock_config_t clk_cfg = {
        .mclk_from_mclk_pin = true,
        .sample_frequency = 44100,
        .mclk_frequency = 11289600 // 44100 * 256
    };

    ESP_ERROR_CHECK(es8311_init(es_handle, &clk_cfg, ES8311_RESOLUTION_16, ES8311_RESOLUTION_16));

    // 4. --- THE SILENCE FIXES ---
    
    // A. Force Mic Bias ON (Powers the microphone element)
    uint8_t reg14;
    es8311_read_reg(es_handle, 0x14, &reg14);
    reg14 |= (1 << 4);
    es8311_write_reg(es_handle, 0x14, reg14);

    // B. Force Max Gain (So we can hear even faint noise)
    es8311_write_reg(es_handle, 0x16, 0xBB); // Analog Gain (+30dB)
    es8311_write_reg(es_handle, 0x17, 0xFF); // Digital Volume (0dB / Max)

    // C. Select the Correct Input Pin (THE USUAL SUSPECT)
    // Most modules use Input 1 (0x00). Some use Input 2 (0x50).
    // We will try Input 1 first. If silent, change this to 0x50.
    //es8311_write_reg(es_handle, 0x44, 0x00);
    // C. Select Input 2 (Common for breakout boards)
    // Change 0x00 to 0x50
    es8311_write_reg(es_handle, 0x44, 0x50);

