playrinc/FreeOS/main/ESP32Support.c
    // D. Force ADC Unmute (Register 0x15)
    // Bit 6 controls mute. We must clear it to 0.
    uint8_t reg15;
    es8311_read_reg(es_handle, 0x15, &reg15);
    reg15 &= ~(1 << 6); // Clear Bit 6
    es8311_write_reg(es_handle, 0x15, reg15);

    // D. Unmute Everything
    es8311_voice_mute(es_handle, false);
    es8311_microphone_config(es_handle, false); // False = Analog Mic

    FreeOSLogI("AUDIO", "ES8311 Init Complete. Gain set to MAX.");
}

void debug_microphone_task(void *args) {
    ESP_LOGW("MIC_DEBUG", "Starting Microphone Monitor... (Check Serial Plotter!)");

    size_t chunk_size = 1024; // Bytes
    int16_t *buffer = cc_safe_alloc(1, chunk_size);
    size_t bytes_read = 0;

    while (1) {
        // 1. Read Raw Data from I2S
        // Ensure 'rx_handle' is the global handle you created in setupHybridAudio
        if (i2s_channel_read(rx_handle, buffer, chunk_size, &bytes_read, 1000) == ESP_OK) {
            
            // 2. Process the Data (Find Peak Volume)
            int32_t sum_left = 0;
            int32_t max_left = 0;
            int32_t max_right = 0;
            
            int samples = bytes_read / 2; // Total 16-bit samples
            
            // Iterate by 2 because we are in Stereo (Left, Right, Left, Right...)
            for (int i = 0; i < samples; i += 2) {
                int16_t left_val = buffer[i];
                int16_t right_val = buffer[i+1];

                if (abs(left_val) > max_left) max_left = abs(left_val);
                if (abs(right_val) > max_right) max_right = abs(right_val);
            }

            // 3. Print Results (Use Serial Plotter for cool graphs)
            // If these numbers are > 50, your mic is working.
            // If these numbers are 0, your mic is dead.
            FreeOSLogI("MIC_DEBUG", "Left Level: %ld  |  Right Level: %ld", (long)max_left, (long)max_right);
        } else {
            FreeOSLogE("MIC_DEBUG", "I2S Read Failed!");
        }
        
        // Slow down the logs so you can read them
        vTaskDelay(pdMS_TO_TICKS(100));
    }

    free(buffer);
    vTaskDelete(NULL);
}


void initializeI2S(void) {
    // --- STEP 1: INITIALIZE I2S (The "Road") ---
    i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
        
        // DMA Buffer Tuning for 16-bit
        // 16-bit stereo frame = 4 bytes.
        // 1024 frames * 4 bytes = 4096 bytes (This fits in the DMA limit!)
        chan_cfg.dma_desc_num = 8;
        chan_cfg.dma_frame_num = 1023;

        tx_handle = NULL;
        ESP_ERROR_CHECK(i2s_new_channel(&chan_cfg, &tx_handle, &rx_handle));

        i2s_std_config_t std_cfg = {
            .clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(44100),
            // --- CHANGE: Set to 16-bit ---
            .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_STEREO),
            .gpio_cfg = {
                .mclk = GPIO_NUM_42,
                .bclk = GPIO_NUM_39,
                .ws = GPIO_NUM_40,
                .dout = GPIO_NUM_41,
                .din = GPIO_NUM_38,
            },
        };

        ESP_ERROR_CHECK(i2s_channel_init_std_mode(tx_handle, &std_cfg));
    ESP_ERROR_CHECK(i2s_channel_init_std_mode(rx_handle, &std_cfg));
        ESP_ERROR_CHECK(i2s_channel_enable(tx_handle));
    ESP_ERROR_CHECK(i2s_channel_enable(rx_handle));
}

void testGraphics(void) {
    
}

// --- Configuration ---
#define LEDC_TIMER              LEDC_TIMER_0
#define LEDC_MODE               LEDC_LOW_SPEED_MODE // S3 only uses Low Speed Mode
#define LEDC_OUTPUT_IO          (47)                // Your requested Pin
#define LEDC_CHANNEL            LEDC_CHANNEL_0
#define LEDC_DUTY_RES           LEDC_TIMER_13_BIT   // 8192 discrete levels of brightness
#define LEDC_FREQUENCY          (4000)              // 4kHz (Safe for CN5711)

// --- Initialization Function ---
void example_ledc_init(void)
{
    // 1. Prepare and then apply the LEDC PWM timer configuration
    ledc_timer_config_t ledc_timer = {
        .speed_mode       = LEDC_MODE,
        .timer_num        = LEDC_TIMER,
        .duty_resolution  = LEDC_DUTY_RES,
        .freq_hz          = LEDC_FREQUENCY,  // Set frequency of PWM signal
        .clk_cfg          = LEDC_AUTO_CLK
    };
    ESP_ERROR_CHECK(ledc_timer_config(&ledc_timer));

    // 2. Prepare and then apply the LEDC PWM channel configuration
    ledc_channel_config_t ledc_channel = {
        .speed_mode     = LEDC_MODE,
        .channel        = LEDC_CHANNEL,
        .timer_sel      = LEDC_TIMER,
        .intr_type      = LEDC_INTR_DISABLE,
        .gpio_num       = LEDC_OUTPUT_IO,
        .duty           = 0, // Set duty to 0% initially
        .hpoint         = 0
    };
    ESP_ERROR_CHECK(ledc_channel_config(&ledc_channel));
}

// --- The Dedicated Task ---
void pwm_fade_task(void *pvParameters)
{
    uint32_t max_duty = 8191; // 2^13 - 1
    int fade_step = 100;      // How much to jump per cycle
    int delay_ms = 10;        // Speed of the fade

    FreeOSLogI(TAG, "Starting PWM Fade Loop...");

    while (1) {
        // Fade UP
        for (int duty = 0; duty <= max_duty; duty += fade_step) {
            ledc_set_duty(LEDC_MODE, LEDC_CHANNEL, duty);
            ledc_update_duty(LEDC_MODE, LEDC_CHANNEL);
            vTaskDelay(pdMS_TO_TICKS(delay_ms));
        }

        // Fade DOWN
        for (int duty = max_duty; duty >= 0; duty -= fade_step) {
            ledc_set_duty(LEDC_MODE, LEDC_CHANNEL, duty);
            ledc_update_duty(LEDC_MODE, LEDC_CHANNEL);
            vTaskDelay(pdMS_TO_TICKS(delay_ms));
        }

        // Wait at bottom (Off) for 1 second
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

// At top of file
volatile float g_battery_level = 0.0f;

// --- CONFIGURATION ---
#define ADC_UNIT          ADC_UNIT_2
#define ADC_CHANNEL       ADC_CHANNEL_7    // GPIO 34 on original ESP32
#define ADC_ATTEN         ADC_ATTEN_DB_12
#define VOLTAGE_DIVIDER   2.0f

static const char *TAGBattery = "BATTERY_TASK";

// Represents a point on the battery curve: {Voltage, Percentage}
typedef struct {
    float voltage;
    int percentage;
} BatteryPoint;

// Standard Li-Ion Discharge Curve (approximate)
// You can tweak these voltages based on your real-world testing
static const BatteryPoint curve[] = {
    {4.20, 100},
    {4.10, 90},
    {4.00, 80},
    {3.90, 70},
    {3.80, 60},
    {3.70, 50}, // Nominal voltage is usually around 50%
    {3.65, 40},
    {3.60, 30}, // Drops quickly after this
    {3.50, 20},
    {3.40, 10},
    {3.20, 0}   // Cutoff
};

#define POINTS_COUNT (sizeof(curve) / sizeof(curve[0]))

