playrinc/FreeOS/main/ESP32Support.c
uint8_t get_battery_percentage(float voltage)
{
    // 1. Clamp extremely high/low values
    if (voltage >= curve[0].voltage) return 100;
    if (voltage <= curve[POINTS_COUNT - 1].voltage) return 0;

    // 2. Loop through the table to find the range we are in
    for (int i = 0; i < POINTS_COUNT - 1; i++) {
        // Find the two points sandwiching our current voltage
        if (voltage <= curve[i].voltage && voltage > curve[i + 1].voltage) {
            
            float v1 = curve[i].voltage;
            float v2 = curve[i + 1].voltage;
            int p1 = curve[i].percentage;
            int p2 = curve[i + 1].percentage;

            // 3. Linear Interpolation (Math to smooth the gap)
            // This prevents the percentage from jumping 60% -> 50% instantly.
            // It will give you 58%, 57%, etc.
            float percent = p1 + ((voltage - v1) * (p2 - p1) / (v2 - v1));
            
            return (uint8_t)percent;
        }
    }

    return 0; // Should not reach here
}

// 1. The Task Function
// This contains the setup AND the infinite loop for this specific job
void battery_monitor_task(void *pvParameters)
{
    // --- SETUP PHASE (Runs once) ---
    
    // 1. Init ADC Unit (Same as before)
    adc_oneshot_unit_handle_t adc_handle;
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = ADC_UNIT,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config, &adc_handle));

    // 2. Configure Channel (Same as before)
    adc_oneshot_chan_cfg_t config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = ADC_ATTEN,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc_handle, ADC_CHANNEL, &config));

    // 3. Setup Calibration (CHANGED FOR S3)
    adc_cali_handle_t adc_cali_handle = NULL;
    
    // S3 uses "Curve Fitting", not "Line Fitting"
    adc_cali_curve_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT,
        .atten = ADC_ATTEN,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };

    bool do_calibration = false;
    // Note: Function name is also different (create_scheme_curve_fitting)
    if (adc_cali_create_scheme_curve_fitting(&cali_config, &adc_cali_handle) == ESP_OK) {
        do_calibration = true;
        FreeOSLogI(TAG, "ADC Calibration Initialized");
    } else {
        ESP_LOGW(TAG, "ADC Calibration Failed");
    }

    // --- LOOP PHASE (Runs forever) ---
    while (1) {
        //int adc_raw = 0;
        int voltage_mv_pin = 0;
        float battery_voltage = 0;

        // Read Raw
        //ESP_ERROR_CHECK(adc_oneshot_read(adc_handle, ADC_CHANNEL, &adc_raw));

        /*if (do_calibration) {
            // Convert to Millivolts
            ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc_cali_handle, adc_raw, &voltage_mv_pin));
            
            // Apply Divider Math
            battery_voltage = (voltage_mv_pin * VOLTAGE_DIVIDER) / 1000.0f;
            
            FreeOSLogI(TAGBattery, "Battery: %.2f V (%d mV)", battery_voltage, voltage_mv_pin);
        } else {
            ESP_LOGW(TAGBattery, "Raw: %d (No Calib)", adc_raw);
        }*/
        
        uint32_t raw_sum = 0;
        const int SAMPLES = 64; // Take 64 samples to smooth out noise

        // 1. Burst Read
        for (int i = 0; i < SAMPLES; i++) {
            int temp_raw = 0;
            adc_oneshot_read(adc_handle, ADC_CHANNEL, &temp_raw);
            raw_sum += temp_raw;
            // Tiny delay helps separate noise spikes
            vTaskDelay(pdMS_TO_TICKS(100));
        }

        // 2. Average
        int adc_raw = raw_sum / SAMPLES;

        if (do_calibration) {
            // Convert the AVERAGED raw value to voltage
            ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc_cali_handle, adc_raw, &voltage_mv_pin));
            
            battery_voltage = (voltage_mv_pin * 2.0f) / 1000.0f;
            uint8_t pct = get_battery_percentage(battery_voltage);
            
            FreeOSLogI(TAG, "Battery (Avg): %.2f V | %d%%", battery_voltage, pct);
        }
        
        // Inside Task loop
        g_battery_level = battery_voltage;

        // Inside any other task
        printf("Current Level: %.2f", g_battery_level);
        
        // 3. Convert to Percentage
        uint8_t pct = get_battery_percentage(battery_voltage);
            
        FreeOSLogI(TAG, "Battery: %.2f V | %d%%", battery_voltage, pct);

        // Delay for 5 seconds (5000ms)
        // This frees up the CPU for other tasks
        vTaskDelay(pdMS_TO_TICKS(100));

        
    }
    
    // Tasks should never return. If they do, they must delete themselves.
    vTaskDelete(NULL);
}


